{
  "1A": {
    "section_name": "Risk Factors",
    "tables": {
      "table_1": [
        "liabilities. We are subject to income taxes in the U.S. and many foreign jurisdictions. Significant judgment is required in determining our worldwide provision for income taxes. In the course of our business, there are many transactions and calculations where the ultimate tax determination is uncertain. For example, compliance with the 2017 United States Tax Cuts and Jobs Act (“TCJA”) and possible future legislative changes may require the collection of information not regularly produced within the company, the use of estimates in our consolidated financial statements, and the exercise of significant judgment in accounting for its provisions. As regulations and guidance evolve with respect to the TCJA or possible future legislative changes, and as we gather more information and perform more analysis, our results may differ from previous estimates and may materially affect our consolidated financial statements."
      ],
      "table_2": [
        "income taxes in the U.S. and many foreign jurisdictions. Significant judgment is required in determining our worldwide provision for income taxes. In the course of our business, there are many transactions and calculations where the ultimate tax determination is uncertain. For example, compliance with the 2017 United States Tax Cuts and Jobs Act (“TCJA”) and possible future legislative changes may require the collection of information not regularly produced within the company, the use of estimates in our consolidated financial statements, and the exercise of significant judgment in accounting for its provisions. As regulations and guidance evolve with respect to the TCJA or possible future legislative changes, and as we gather more information and perform more analysis, our results may differ from previous estimates and may materially affect our consolidated financial statements."
      ],
      "table_3": [
        "customers’ decisions to purchase or use our products or services across cloud and on-premises environments. Security threats are a significant challenge to companies like us whose business is providing technology products and services to others. Threats to our own IT infrastructure can also affect our customers. Customers using our cloud-based services rely on the security of our infrastructure, including hardware and other elements provided by third parties, to ensure the reliability of our services and the protection of their data. Adversaries tend to focus their efforts on the most popular operating systems, programs, and services, including many of ours, and we expect that to continue. In addition, adversaries can attack our customers’ on-premises or cloud environments, sometimes exploiting previously unknown (“zero day”) vulnerabilities, such as occurred in early calendar year 2021 with several of our Exchange Server on-premises products. Vulnerabilities in these or any product can persist even after we have issued security patches if customers have not installed the most recent updates, or if the attackers exploited the vulnerabilities before patching to install additional malware to further compromise customers’ systems. Adversaries will continue to attack customers using our cloud services as customers embrace digital transformation. Adversaries that acquire user account information can use that information to compromise our users’ accounts, including where accounts share the same attributes such as passwords. Inadequate account security practices may also result in unauthorized access, and user activity may result in ransomware or other malicious software impacting a customer’s use of our products or services. We are increasingly incorporating open source software into our products. There may be vulnerabilities in open source software that may make our products susceptible to cyberattacks. Additionally, we are actively adding new generative AI features to our services. Because generative AI is a new field, understanding of security risks and protection methods continues to develop; features that rely on generative AI may be susceptible to unanticipated security threats from sophisticated adversaries."
      ],
      "table_4": [
        "marketing for existing products, services, and technologies, including the Windows operating system, Microsoft 365, Bing, SQL Server, Windows Server, Azure, Office 365, Xbox, LinkedIn, and other products and services. In addition, we are focused on developing new AI platform services and incorporating AI into existing products and services. We also invest in the development and acquisition of a variety of hardware for productivity, communication, and entertainment, including PCs, tablets, gaming devices, and HoloLens. Investments in new technology are speculative. Commercial success depends on many factors, including innovativeness, developer support, and effective distribution and marketing. If customers do not perceive our latest offerings as providing significant new functionality or other value, they may reduce their purchases of new software and hardware products or upgrades, unfavorably affecting revenue. We may not achieve significant revenue from new product, service, and distribution channel investments for several years, if at all. New products and services may not be profitable, and even if they are profitable, operating margins for some new products and businesses will not be as high as the margins we have experienced historically. We may not get engagement in certain features, like Microsoft Edge, Bing, and Bing Chat, that drive post-sale monetization opportunities. Our data handling practices across our products and services will continue to be under scrutiny. Perceptions of mismanagement, driven by regulatory activity or negative public reaction to our practices or product experiences, could negatively impact product and feature adoption, product design, and product quality."
      ],
      "table_5": [
        "technology products and services to others. Threats to our own IT infrastructure can also affect our customers. Customers using our cloud-based services rely on the security of our infrastructure, including hardware and other elements provided by third parties, to ensure the reliability of our services and the protection of their data. Adversaries tend to focus their efforts on the most popular operating systems, programs, and services, including many of ours, and we expect that to continue. In addition, adversaries can attack our customers’ on-premises or cloud environments, sometimes exploiting previously unknown (“zero day”) vulnerabilities, such as occurred in early calendar year 2021 with several of our Exchange Server on-premises products. Vulnerabilities in these or any product can persist even after we have issued security patches if customers have not installed the most recent updates, or if the attackers exploited the vulnerabilities before patching to install additional malware to further compromise customers’ systems. Adversaries will continue to attack customers using our cloud services as customers embrace digital transformation. Adversaries that acquire user account information can use that information to compromise our users’ accounts, including where accounts share the same attributes such as passwords. Inadequate account security practices may also result in unauthorized access, and user activity may result in ransomware or other malicious software impacting a customer’s use of our products or services. We are increasingly incorporating open source software into our products. There may be vulnerabilities in open source software that may make our products susceptible to cyberattacks. Additionally, we are actively adding new generative AI features to our services. Because generative AI is a new field, understanding of security risks and protection methods continues to develop; features that rely on generative AI may be susceptible to unanticipated security threats from sophisticated adversaries."
      ],
      "table_6": [
        "technology and network infrastructure to handle more traffic on our websites and in our datacenters. Our datacenters depend on the availability of permitted and buildable land, predictable energy, networking supplies, and servers, including graphics processing units (“GPUs”) and other components. The cost or availability of these dependencies could be adversely affected by a variety of factors, including the transition to a clean energy economy, local and regional environmental regulations, and geopolitical disruptions. These demands continue to increase as we introduce new products and services and support the growth and the augmentation of existing services such as Bing, Azure, Microsoft Account services, Microsoft 365, Microsoft Teams, Dynamics 365, OneDrive, SharePoint Online, Skype, Xbox, and Outlook.com through the incorporation of AI features and/or functionality. We are rapidly growing our business of providing a platform and back-end hosting for services provided by third parties to their end users. Maintaining, securing, and expanding this infrastructure is expensive and complex, and requires development of principles for datacenter builds in geographies with higher safety and reliability risks. It requires that we maintain an Internet connectivity infrastructure and storage and compute capacity that is robust and reliable within competitive and regulatory constraints that continue to evolve. Inefficiencies or operational failures, including temporary or permanent loss of customer data, insufficient Internet connectivity, insufficient or unavailable power supply, or inadequate storage and compute capacity, could diminish the quality of our products, services, and user experience resulting in contractual liability, claims by customers and other third parties, regulatory actions, damage to our reputation, and loss of current and potential users, subscribers, and advertisers, each of which may adversely impact our consolidated financial statements."
      ],
      "table_7": [
        "regulatory complexity is the EU Whistleblower Directive, initiated in 2021, which may present compliance challenges to the extent it is implemented in different forms by EU member states. Most countries in which we operate also have competition laws that prohibit competitors from colluding or otherwise attempting to reduce competition between themselves. While we devote substantial resources to our U.S. and international compliance programs and have implemented policies, training, and internal controls designed to reduce the risk of corrupt payments and collusive activity, our employees, vendors, or agents may violate our policies. Our failure to comply with Anti-Corruption Laws or competition laws could result in significant fines and penalties, criminal sanctions against us, our officers, or our employees, prohibitions on the conduct of our business, and damage to our reputation."
      ],
      "table_8": [
        "regulatory requirements also affect our operations in and outside the U.S. relating to trade and investment. Economic sanctions in the U.S., the EU, and other countries prohibit most business with restricted entities or countries. U.S. export controls restrict Microsoft from offering many of its products and services to, or making investments in, certain entities in specified countries. U.S. import controls restrict us from integrating certain information and communication technologies into our supply chain and allow for government review of transactions involving information and communications technology from countries determined to be foreign adversaries. Supply chain regulations may impact the availability of goods or result in additional regulatory scrutiny. Periods of intense diplomatic or armed conflict, such as the ongoing conflict in Ukraine, may result in (1) new and rapidly evolving sanctions and trade restrictions, which may impair trade with sanctioned individuals and countries, and (2) negative impacts to regional trade ecosystems among our customers, partners, and us. Non-compliance with sanctions as well as general ecosystem disruptions could result in reputational harm, operational delays, monetary fines, loss of revenues, increased costs, loss of export privileges, or criminal sanctions."
      ]
    },
    "table_count": 8,
    "word_count": 1714,
    "character_count": 12042,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "1A",
      "original_length": 69227,
      "original_word_count": 10104,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/789019/000095017023035122/msft-20230630.htm",
      "filing_date": "2023-07-27T16:01:56-04:00"
    }
  },
  "7": {
    "section_name": "Management's Discussion and Analysis",
    "tables": {
      "table_1": [
        "Commercial remaining performance obligation Commercial portion of revenue allocated to remaining performance obligations, which includes unearned revenue and amounts that will be invoiced and recognized as revenue in future periods Microsoft Cloud revenue Revenue from Azure and other cloud services, Office 365 Commercial, the commercial portion of LinkedIn, Dynamics 365, and other commercial cloud properties Microsoft Cloud gross margin percentage Gross margin percentage for our Microsoft Cloud business"
      ],
      "table_2": [
        "Office Commercial products and cloud services revenue growth Revenue from Office Commercial products and cloud services (Office 365 subscriptions, the Office 365 portion of Microsoft 365 Commercial subscriptions, and Office licensed on-premises), comprising Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, Microsoft Viva, and Microsoft 365 Copilot Office Consumer products and cloud services revenue growth Revenue from Office Consumer products and cloud services, including Microsoft 365 Consumer subscriptions, Office licensed on-premises, and other Office services Office 365 Commercial seat growth The number of Office 365 Commercial seats at end of period where seats are paid users covered by an Office 365 Commercial subscription Microsoft 365 Consumer subscribers The number of Microsoft 365 Consumer subscribers at end of period Dynamics products and cloud services revenue growth Revenue from Dynamics products and cloud services, including Dynamics 365, comprising a set of intelligent, cloud-based applications across ERP, CRM (including Customer Insights), Power Apps, and Power Automate; and on-premises ERP and CRM applications LinkedIn revenue growth Revenue from LinkedIn, including Talent Solutions, Marketing Solutions, Premium Subscriptions, and Sales Solutions Server products and cloud services revenue growth Revenue from Server products and cloud services, including Azure and other cloud services; SQL Server, Windows Server, Visual Studio, System Center, and related Client Access Licenses (“CALs”); and Nuance and GitHub"
      ]
    },
    "table_count": 2,
    "word_count": 283,
    "character_count": 2091,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "7",
      "original_length": 63391,
      "original_word_count": 9066,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/789019/000095017023035122/msft-20230630.htm",
      "filing_date": "2023-07-27T16:01:56-04:00"
    }
  },
  "8": {
    "section_name": "Financial Statements and Supplementary Data",
    "tables": {
      "table_1": [
        "Less than 12 Months 12 Months or Greater Total Unrealized Losses (In millions) Fair Value Unrealized Losses Fair Value Unrealized Losses Total Fair Value June 30, 2023 U.S. government and agency securities $ 7,950 $ ( 336 ) $ 45,273 $ ( 3,534 ) $ 53,223 $ ( 3,870 ) Foreign government bonds ( 5 ) ( 19 ) ( 24 ) Mortgage- and asset-backed securities ( 5 ) ( 34 ) ( 39 ) Corporate notes and bonds 2,326 ( 49 ) 7,336 ( 534 ) 9,662 ( 583 ) Municipal securities ( 3 ) ( 31 ) ( 34 ) Total $ 10,721 $ ( 398 ) $ 53,598 $ ( 4,152 ) $ 64,319 $ ( 4,550 )"
      ],
      "table_2": [
        "Less than 12 Months 12 Months or Greater Total Unrealized Losses (In millions) Fair Value Unrealized Losses Fair Value Unrealized Losses Total Fair Value June 30, 2022 U.S. government and agency securities $ 59,092 $ ( 1,835 ) $ 2,210 $ ( 352 ) $ 61,302 $ ( 2,187 ) Foreign government bonds ( 18 ) ( 6 ) ( 24 ) Mortgage- and asset-backed securities ( 26 ) ( 4 ) ( 30 ) Corporate notes and bonds 9,443 ( 477 ) ( 77 ) 10,229 ( 554 ) Municipal securities ( 12 ) ( 7 ) ( 19 ) Total $ 69,641 $ ( 2,368 ) $ 3,138 $ ( 446 ) $ 72,779 $ ( 2,814 )"
      ],
      "table_3": [
        "Year Ended June 30, 2022 Federal statutory rate 21.0 % 21.0 % 21.0 % Effect of: Foreign earnings taxed at lower rates ( 1.8 )% ( 1.3 )% ( 2.7 )% Impact of intangible property transfers 0 % ( 3.9 )% 0 % Foreign-derived intangible income deduction ( 1.3 )% ( 1.1 )% ( 1.3 )% State income taxes, net of federal benefit 1.6 % 1.4 % 1.4 % Research and development credit ( 1.1 )% ( 0.9 )% ( 0.9 )% Excess tax benefits relating to stock-based compensation ( 0.7 )% ( 1.9 )% ( 2.4 )% Interest, net 0.8 % 0.5 % 0.5 % Other reconciling items, net 0.5 % ( 0.7 )% ( 1.8 )% Effective rate 19.0 % 13.1 % 13.8 %"
      ],
      "table_4": [
        "Declaration Date Record Date Payment Date Dividend Per Share Amount Fiscal Year 2023 (In millions) September 20, 2022 November 17, 2022 December 8, 2022 $ 0.68 $ 5,066 November 29, 2022 February 16, 2023 March 9, 2023 0.68 5,059 March 14, 2023 May 18, 2023 June 8, 2023 0.68 5,054 June 13, 2023 August 17, 2023 September 14, 2023 0.68 5,054 Total $ 2.72 $ 20,233 Fiscal Year 2022 September 14, 2021 November 18, 2021 December 9, 2021 $ 0.62 $ 4,652 December 7, 2021 February 17, 2022 March 10, 2022 0.62 4,645 March 14, 2022 May 19, 2022 June 9, 2022 0.62 4,632 June 14, 2022 August 18, 2022 September 8, 2022 0.62 4,621 Total $ 2.48 $ 18,550"
      ],
      "table_5": [
        "Year ended June 30, Dividends per share (quarterly amounts) $ 0.62 – 0.68 $ 0.56 – 0.62 $ 0.51 – 0.56 Interest rates 2.0 % – 5.4 % 0.03 % – 3.6 % 0.01 % – 1.5 %"
      ],
      "table_6": [
        "Shares Weighted Average Grant-Date Fair Value (In millions) Stock Awards Nonvested balance, beginning of year $ 227.59 Granted (a) 252.59 Vested ( 44 ) 206.90 Forfeited ( 9 ) 239.93 Nonvested balance, end of year $ 250.37"
      ]
    },
    "table_count": 6,
    "word_count": 562,
    "character_count": 2705,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "8",
      "original_length": 173121,
      "original_word_count": 23392,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/789019/000095017023035122/msft-20230630.htm",
      "filing_date": "2023-07-27T16:01:56-04:00"
    }
  },
  "9A": {
    "section_name": "Controls and Procedures",
    "tables": {
      "table_1": [
        "for the year ended June 30, 2023, of the Company and our report dated July 27, 2023, expressed an unqualified opinion on those financial statements."
      ],
      "table_2": [
        "quarter ended June 30, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Deloitte & Touche LLP has audited our internal control over financial reporting as of June 30, 2023; their report is included in Item 9A."
      ],
      "table_3": [
        "June 30, 2023. There were no changes in our internal control over financial reporting during the quarter ended June 30, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Deloitte & Touche LLP has audited our internal control over financial reporting as of June 30, 2023; their report is included in Item 9A."
      ],
      "table_4": [
        "June 30, 2023, based on criteria established in Internal Control — Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of June 30, 2023, based on criteria established in Internal Control — Integrated Framework (2013) issued by COSO."
      ],
      "table_5": [
        "June 30, 2023, of the Company and our report dated July 27, 2023, expressed an unqualified opinion on those financial statements."
      ],
      "table_6": [
        "assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements."
      ],
      "table_7": [
        "consolidated financial statements as of and for the year ended June 30, 2023, of the Company and our report dated July 27, 2023, expressed an unqualified opinion on those financial statements."
      ],
      "table_8": [
        "financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements."
      ]
    },
    "table_count": 8,
    "word_count": 452,
    "character_count": 3048,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "9A",
      "original_length": 6802,
      "original_word_count": 974,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/789019/000095017023035122/msft-20230630.htm",
      "filing_date": "2023-07-27T16:01:56-04:00"
    }
  }
}