{
  "1A": {
    "section_name": "Risk Factors",
    "tables": {
      "balance_sheet_1": [
        "liabilities. We are subject to income taxes in the U.S. and many foreign jurisdictions. Significant judgment is required in determining our worldwide provision for income taxes. In the course of our business, there are many transactions and calculations where the ultimate tax determination is uncertain. For example, compliance with the 2017 United States Tax Cuts and Jobs Act (“TCJA”) and possible future legislative changes may require the collection of information not regularly produced within the Company, the use of estimates in our consolidated financial statements, and the exercise of significant judgment in accounting for its provisions. As regulations and guidance evolve with respect to the TCJA or possible future legislative changes , and as we gather more information and perform more analysis, our results may differ from previous estimates and may materially affect our consolidated financial statements."
      ],
      "business_metrics_2": [
        "volume Microsoft products and the terms on which we make certain technologies used in these products, such as file formats, programming interfaces, and protocols, available to other companies. Flagship product releases such as Windows can receive significant scrutiny under competition laws. For example, in 2004, the Commission ordered us to create new versions of our Windows operating system that do not include certain multimedia technologies and to provide our competitors with specifications for how to implement certain proprietary Windows communications protocols in their own products. In 2009, the Commission accepted a set of commitments we offered to address the Commission’s concerns relating to competition in web browsing software, including an undertaking to address Commission concerns relating to interoperability. The web browsing commitments expired in 2014. The remaining obligations may limit our ability to innovate in Windows or other products in the future, diminish the developer appeal of the Windows platform, and increase our product development costs. The availability of licenses related to protocols and file formats may enable competitors to develop software products that better mimic the functionality of our products, which could hamper sales of our products."
      ],
      "business_metrics_3": [
        "customers’ decisions to purchase or use our products or services across cloud and on-premises environments. Security threats are a significant challenge to companies like us whose business is providing technology products and services to others. Threats to our own IT infrastructure can also affect our customers. Customers using our cloud-based services rely on the security of our infrastructure, including hardware and other elements provided by third parties, to ensure the reliability of our services and the protection of their data. Adversaries tend to focus their efforts on the most popular operating systems, programs, and services, including many of ours, and we expect that to continue. In addition, adversaries can attack our customers’ on-premises or cloud environments, sometimes exploiting previously unknown (“zero day”) vulnerabilities, such as occurred in early calendar year 2021 with several of our Exchange Server on-premises products. Vulnerabilities in these or any product can persist even after we have issued security patches if customers have not installed the most recent updates, or if the attackers exploited the vulnerabilities before patching to install additional malware to further compromise customers’ systems. Adversaries will continue to attack customers using our cloud services as customers embrace digital transformation. Adversaries that acquire user account information can use that information to compromise our users’ accounts, including where accounts share the same attributes as passwords. Inadequate account security practices may also result in unauthorized access, and user activity may result in ransomware or other malicious software impacting a customer’s use of our products or services. We are increasingly incorporating open source software into our products. There may be vulnerabilities in open source software that may make our products susceptible to cyberattacks."
      ],
      "business_metrics_4": [
        "employees, vendors, or agents, and the accounting provisions of the FCPA require us to maintain accurate books and records and adequate internal controls. From time to time, we receive inquiries from authorities in the U.S. and elsewhere which may be based on reports from employees and others about our business activities outside the U.S. and our compliance with Anti-Corruption Laws. Periodically, we receive such reports directly and investigate them. On July 22, 2019, our Hungarian subsidiary entered into a non-prosecution agreement (“NPA”) with the U.S. Department of Justice (“DOJ”) and we agreed to the terms of a cease and desist order with the Securities and Exchange Commission. These agreements required us to pay $25.3 million in monetary penalties, disgorgement, and interest pertaining to activities at Microsoft’s subsidiary in Hungary. The NPA, which has a three-year term, also contains certain ongoing compliance requirements, including the obligations to disclose to the DOJ issues that may implicate the FCPA and to cooperate in any inquiries. Most countries in which we operate also have competition laws that prohibit competitors from colluding or otherwise attempting to reduce competition between themselves. While we devote substantial resources to our U.S. and international compliance programs and have implemented policies, training, and internal controls designed to reduce the risk of corrupt payments and collusive activity, our employees, vendors, or agents may violate our policies. Our failure to comply with Anti-Corruption Laws or competition laws could result in significant fines and penalties, criminal sanctions against us, our officers, or our employees, prohibitions on the conduct of our business, and damage to our reputation."
      ],
      "business_metrics_5": [
        "customers meet their obligations under the GDPR or other data regulations, or if our implementation to comply with the GDPR make s our offerings less attractive. The GDPR imposes significant new obligations and compliance with these obligations depends in part on how particular regulators interpret and apply them. If we fail to comply with the GDPR, or if regulators assert we have failed to comply with the GDPR, it may lead to regulatory enforcement actions, which can result in monetary penalties of up to 4% of worldwide revenue, private lawsuits, reputational damage , and loss of customers . Countries around the world, and states in the U.S . such as California , Colorado, and Virginia , ha ve adopted, or are considering adopting or expanding , laws and regulations imposing obligations regarding the handling of personal data."
      ],
      "risk_factors_6": [
        "concerns relating to competition in web browsing software, including an undertaking to address Commission concerns relating to interoperability. The web browsing commitments expired in 2014. The remaining obligations may limit our ability to innovate in Windows or other products in the future, diminish the developer appeal of the Windows platform, and increase our product development costs. The availability of licenses related to protocols and file formats may enable competitors to develop software products that better mimic the functionality of our products, which could hamper sales of our products."
      ],
      "financial_ratios_7": [
        "growth in services, and the complexity of our products and services demand more computing power. We spend substantial amounts to build, purchase, or lease datacenters and equipment and to upgrade our technology and network infrastructure to handle more traffic on our websites and in our datacenters. These demands continue to increase as we introduce new products and services and support the growth of existing services such as Bing, Azure, Microsoft Account services, Microsoft 365, Microsoft Teams, Dynamics 365, OneDrive, SharePoint Online, Skype, Xbox, and Outlook.com. We are rapidly growing our business of providing a platform and back-end hosting for services provided by third parties to their end users. Maintaining, securing, and expanding this infrastructure is expensive and complex, and requires development of principles for datacenter builds in geographies with higher safety risks. It requires that we maintain an Internet connectivity infrastructure and storage and compute capacity that is robust and reliable within competitive and regulatory constraints that continue to evolve. Inefficiencies or operational failures, including temporary or permanent loss of customer data, insufficient Internet connectivity, or inadequate storage and compute capacity, could diminish the quality of our products, services, and user experience resulting in contractual liability, claims by customers and other third parties, regulatory actions, damage to our reputation, and loss of current and potential users, subscribers, and advertisers, each of which may adversely impact our consolidated financial statements."
      ],
      "financial_ratios_8": [
        "growth of our Internet- and cloud-based services internationally relies increasingly on the movement of data across national boundaries. Legal requirements relating to the collection, storage, handling, and transfer of personal data continue to evolve. For example, in July 2020 the Court of Justice of the EU invalidated a framework called Privacy Shield for companies to transfer data from EU member states to the United States. This ruling has led to uncertainty about the legal requirements for data transfers from the EU under other l egal mechanisms. Potential new rules and restrictions on the flow of data across borders could increase the cost and complexity of delivering our products and services in some markets. In May 2018, the EU General Data Protection Regulation (“GDPR”), became effective. The law, which applies to all of our activities conducted from an establishment in the EU or related to products and services offered in the EU, imposes a range of compliance obligations regarding the handling of personal data. Engineering efforts to build and maintain capabilities to facilitate compliance with the law have entailed substantial expense and the diversion of engineering resources from other projects and may continue to do so. We might experience reduced demand for our offerings if we are unable to engineer products that meet our legal duties or help our customers meet their obligations under the GDPR or other data regulations, or if our implementation to comply with the GDPR make s our offerings less attractive. The GDPR imposes significant new obligations and compliance with these obligations depends in part on how particular regulators interpret and apply them. If we fail to comply with the GDPR, or if regulators assert we have failed to comply with the GDPR, it may lead to regulatory enforcement actions, which can result in monetary penalties of up to 4% of worldwide revenue, private lawsuits, reputational damage , and loss of customers . Countries around the world, and states in the U.S . such as California , Colorado, and Virginia , ha ve adopted, or are considering adopting or expanding , laws and regulations imposing obligations regarding the handling of personal data."
      ]
    },
    "table_count": 8,
    "word_count": 1673,
    "character_count": 11214,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "1A",
      "original_length": 70302,
      "original_word_count": 10218,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/789019/000156459021039151/msft-10k_20210630.htm",
      "filing_date": "2021-07-29T16:21:55-04:00"
    }
  },
  "7": {
    "section_name": "Management's Discussion and Analysis",
    "tables": {
      "table_1": [
        "• Commercial cloud revenue increased 34% to $69.1 billion."
      ],
      "table_2": [
        "• Office Commercial products and cloud services revenue increased 13% driven by Office 365 Commercial growth of 22%."
      ],
      "table_3": [
        "• Office Consumer products and cloud services revenue increased 10% and Microsoft 365 Consumer subscribers increased to 51.9 million."
      ],
      "table_4": [
        "• Dynamics products and cloud services revenue increased 25% driven by Dynamics 365 growth of 43%."
      ],
      "table_5": [
        "• Server products and cloud services revenue increased 27% driven by Azure growth of 50%."
      ],
      "table_6": [
        "• Windows Commercial products and cloud services revenue increased 14%."
      ],
      "table_7": [
        "• Search advertising revenue, excluding traffic acquisition costs, increased 13%."
      ],
      "table_8": [
        "Commercial remaining performance obligation Commercial portion of revenue allocated to remaining performance obligations, which includes unearned revenue and amounts that will be invoiced and recognized as revenue in future periods Commercial cloud revenue Revenue from our commercial cloud business, which includes Azure, Office 365 Commercial, the commercial portion of LinkedIn, Dynamics 365, and other commercial cloud properties Commercial cloud gross margin percentage Gross margin percentage for our commercial cloud business"
      ],
      "table_9": [
        "Office Commercial products and cloud services revenue growth Revenue from Office Commercial products and cloud services (Office 365 subscriptions, the Office 365 portion of Microsoft 365 Commercial subscriptions, and Office licensed on-premises), comprising Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business Office Consumer products and cloud services revenue growth Revenue from Office Consumer products and cloud services, including Microsoft 365 Consumer subscriptions and Office licensed on-premises Office 365 Commercial seat growth The number of Office 365 Commercial seats at end of period where seats are paid users covered by an Office 365 Commercial subscription Microsoft 365 Consumer subscribers The number of Microsoft 365 Consumer (formerly Office 365 Consumer) subscribers at end of period Dynamics products and cloud services revenue growth Revenue from Dynamics products and cloud services, including Dynamics 365, comprising a set of intelligent, cloud-based applications across ERP, CRM, Customer Insights, Power Apps, and Power Automate; and on-premises ERP and CRM applications LinkedIn revenue growth Revenue from LinkedIn, including Talent Solutions, Marketing Solutions, Premium Subscriptions, Sales Solutions, and Learning Solutions Server products and cloud services revenue growth Revenue from Server products and cloud services, including Azure; SQL Server, Windows Server, Visual Studio, System Center, and related Client Access Licenses (“CALs”); and GitHub"
      ],
      "table_10": [
        "• Research and development expenses increased $1.4 billion or 8% driven by investments in cloud engineering."
      ],
      "table_11": [
        "• Sales and marketing expenses increased $519 million or 3% driven by investments in commercial sales, offset in part by a reduction in bad debt expense. Sales and marketing included an unfavorable foreign currency impact of 2%."
      ],
      "table_12": [
        "• Office Commercial products and cloud services revenue increased $4.0 billion or 13%. Office 365 Commercial revenue grew 22% driven by seat growth of 17% and higher revenue per user. Office Commercial products revenue declined 23% driven by continued customer shift to cloud offerings and transactional weakness."
      ],
      "table_13": [
        "• Office Consumer products and cloud services revenue increased $474 million or 10% driven by Microsoft 365 Consumer subscription revenue, on a strong prior year comparable that benefited from transactional strength in Japan. Microsoft 365 Consumer subscribers increased 22% to 51.9 million."
      ],
      "table_14": [
        "• LinkedIn revenue increased $2.2 billion or 27% driven by advertising demand in our Marketing Solutions business."
      ],
      "table_15": [
        "• Dynamics products and cloud services revenue increased 25% driven by Dynamics 365 growth of 43%."
      ],
      "table_16": [
        "• Gross margin increased $6.5 billion or 18% driven by growth in Office 365 Commercial and LinkedIn, and the change in estimated useful lives of our server and network equipment. Gross margin percentage increased with the change in estimated useful lives of our server and network equipment. Excluding this impact, gross margin percentage decreased slightly driven by a sales mix shift to cloud offerings, on a low prior year comparable impacted by increased usage."
      ],
      "table_17": [
        "• Operating expenses increased $839 million or 5% driven by investments in commercial sales, cloud engineering, and LinkedIn."
      ],
      "table_18": [
        "• Server products and cloud services revenue increased $11.2 billion or 27% driven by Azure. Azure revenue grew 50% due to growth in our consumption-based services. Server products revenue increased 6% driven by hybrid and premium solutions, on a strong prior year comparable that benefited from demand related to SQL Server 2008 and Windows Server 2008 end of support."
      ],
      "table_19": [
        "• Enterprise Services revenue increased $534 million or 8% driven by growth in Premier Support Services."
      ],
      "table_20": [
        "• Gross margin increased $9.7 billion or 29% driven by growth in Azure and the change in estimated useful lives of our server and network equipment. Gross margin percentage increased with the change in estimated useful lives of our server and network equipment. Excluding this impact, gross margin percentage was relatively unchanged driven by gross margin percentage improvement in Azure, offset in part by sales mix shift to Azure."
      ],
      "table_21": [
        "• Operating expenses increased $1.9 billion or 12% driven by investments in Azure."
      ],
      "table_22": [
        "• Windows revenue increased $933 million or 4% driven by growth in Windows Commercial. Windows Commercial products and cloud services revenue increased 14% driven by demand for Microsoft 365. Windows OEM revenue increased slightly driven by consumer PC demand, on a strong prior year OEM Pro comparable that benefited from Windows 7 end of support. Windows OEM Pro revenue decreased 9% and Windows OEM non-Pro revenue grew 21%."
      ],
      "table_23": [
        "• Gaming revenue increased $3.8 billion or 33% driven by growth in Xbox content and services and Xbox hardware. Xbox content and services revenue increased $2.3 billion or 23% driven by growth in third-party titles, Xbox Game Pass subscriptions, and first-party titles. Xbox hardware revenue increased 92% driven by higher price of consoles sold due to the Xbox Series X|S launches."
      ],
      "table_24": [
        "• Search advertising revenue increased $788 million or 10%. Search advertising revenue excluding traffic acquisition costs increased 13% driven by higher revenue per search and search volume."
      ],
      "table_25": [
        "• Gross margin increased $2.8 billion or 10% driven by growth in Windows, Gaming, and Search advertising. Gross margin percentage decreased driven by sales mix shift to Gaming hardware."
      ],
      "table_26": [
        "• Operating expenses decreased $752 million or 6% driven by prior year charges associated with the closing of our Microsoft Store physical locations and reductions in retail store expenses and marketing, offset in part by investments in Gaming."
      ]
    },
    "table_count": 26,
    "word_count": 1023,
    "character_count": 6905,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "7",
      "original_length": 66940,
      "original_word_count": 9599,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/789019/000156459021039151/msft-10k_20210630.htm",
      "filing_date": "2021-07-29T16:21:55-04:00"
    }
  },
  "8": {
    "section_name": "Financial Statements and Supplementary Data",
    "tables": {
      "table_1": [
        "• Level 1 – inputs are based upon unadjusted quoted prices for identical instruments in active markets. Our Level 1 investments include U.S. government securities, common and preferred stock, and mutual funds. Our Level 1 derivative assets and liabilities include those actively traded on exchanges."
      ],
      "table_2": [
        "• Level 2 – inputs are based upon quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques (e.g. the Black-Scholes model) for which all significant inputs are observable in the market or can be corroborated by observable market data for substantially the full term of the assets or liabilities. Where applicable, these models project future cash flows and discount the future amounts to a present value using market-based observable inputs including interest rate curves, credit spreads, foreign exchange rates, and forward and spot prices for currencies. Our Level 2 investments include commercial paper, certificates of deposit, U.S. agency securities, foreign government bonds, mortgage- and asset-backed securities, corporate notes and bonds, and municipal securities. Our Level 2 derivative assets and liabilities primarily include certain over-the-counter option and swap contracts."
      ],
      "table_3": [
        "• Level 3 – inputs are generally unobservable and typically reflect management’s estimates of assumptions that market participants would use in pricing the asset or liability. The fair values are therefore determined using model-based techniques, including option pricing models and discounted cash flow models. Our Level 3 assets and liabilities include investments in corporate notes and bonds , municipal securities , and goodwill and intangible assets, when they are recorded at fair value due to an impairment charge. Unobservable inputs used in the models are significant to the fair values of the assets and liabilities."
      ],
      "table_4": [
        "Less than 12 Months 12 Months or Greater Total Unrealized Losses (In millions) Fair Value Unrealized Losses Fair Value Unrealized Losses Total Fair Value June 30, 2021 U.S. government and agency securities $ 5,294 $ ( 111 ) $ $ $ 5,294 $ ( 111 ) Foreign government bonds 3,148 ( 1 ) ( 1 ) 3,153 ( 2 ) Mortgage- and asset-backed securities 1,211 ( 5 ) ( 1 ) 1,298 ( 6 ) Corporate notes and bonds 1,678 ( 8 ) ( 1 ) 1,712 ( 9 ) Municipal securities ( 7 ) ( 7 ) Total $ 11,389 $ ( 132 ) $ $ ( 3 ) $ 11,516 $ ( 135 )"
      ],
      "table_5": [
        "Less than 12 Months 12 Months or Greater Total Unrealized Losses (In millions) Fair Value Unrealized Losses Fair Value Unrealized Losses Total Fair Value June 30, 2020 U.S. government and agency securities $ 2,323 $ ( 1 ) $ $ $ 2,323 $ ( 1 ) Foreign government bonds ( 3 ) ( 3 ) Mortgage- and asset-backed securities 1,014 ( 6 ) 1,014 ( 6 ) Corporate notes and bonds ( 17 ) ( 17 ) Municipal securities ( 4 ) ( 4 ) Total $ 4,552 $ ( 31 ) $ $ $ 4,552 $ ( 31 )"
      ],
      "table_6": [
        "Derivative Derivative Derivative Derivative (In millions) Assets Liabilities Assets Liabilities June 30, June 30, Designated as Hedging Instruments Foreign exchange contracts $ $ ( 8 ) $ $ ( 54 ) Interest rate contracts Not Designated as Hedging Instruments Foreign exchange contracts ( 291 ) ( 334 ) Other contracts ( 36 ) ( 11 ) Gross amounts of derivatives ( 335 ) ( 399 ) Gross amounts of derivatives offset in the balance sheet ( 141 ) ( 154 ) Cash collateral received 0 ( 42 ) ( 154 ) Net amounts of derivatives $ $ ( 235 ) $ $ ( 395 ) Reported as Short-term investments $ $ $ $ Other current assets Other long-term assets Other current liabilities ( 182 ) ( 334 ) Other long-term liabilities ( 53 ) ( 61 ) Total $ $ ( 235 ) $ $ ( 395 )"
      ],
      "table_7": [
        "Year Ended June 30, Federal statutory rate 21.0 % 21.0 % 21.0 % Effect of: Foreign earnings taxed at lower rates ( 2.7 )% ( 3.7 )% ( 4.1 )% Impact of the enactment of the TCJA 0 % 0 % 0.4 % Impact of intangible property transfers 0 % 0 % ( 5.9 )% Foreign-derived intangible income deduction ( 1.3 )% ( 1.1 )% ( 1.4 )% State income taxes, net of federal benefit 1.4 % 1.3 % 0.7 % Research and development credit ( 0.9 )% ( 1.1 )% ( 1.1 )% Excess tax benefits relating to stock-based compensation ( 2.4 )% ( 2.2 )% ( 2.2 )% Interest, net 0.5 % 1.0 % 1.0 % Other reconciling items, net ( 1.8 )% 1.3 % 1.8 % Effective rate 13.8 % 16.5 % 10.2 %"
      ],
      "table_8": [
        "Declaration Date Record Date Payment Date Dividend Per Share Amount Fiscal Year 2021 (In millions) September 15, 2020 November 19, 2020 December 10, 2020 $ 0.56 $ 4,230 December 2, 2020 February 18, 2021 March 11, 2021 0.56 4,221 March 16, 2021 May 20, 2021 June 10, 2021 0.56 4,214 June 16, 2021 August 19, 2021 September 9, 2021 0.56 4,211 Total $ 2.24 $ 16,876 Fiscal Year 2020 September 18, 2019 November 21, 2019 December 12, 2019 $ 0.51 $ 3,886 December 4, 2019 February 20, 2020 March 12, 2020 0.51 3,876 March 9, 2020 May 21, 2020 June 11, 2020 0.51 3,865 June 17, 2020 August 20, 2020 September 10, 2020 0.51 3,856 Total $ 2.04 $ 15,483"
      ],
      "table_9": [
        "Year ended June 30, Dividends per share (quarterly amounts) $ 0.51 – 0.56 $ 0.46 – 0.51 $ 0.42 – 0.46 Interest rates 0.01 % – 1.5 % 0.1 % – 2.2 % 1.8 % – 3.1 %"
      ],
      "table_10": [
        "Shares Weighted Average Grant-Date Fair Value (In millions) Stock Awards Nonvested balance, beginning of year $ 105.23 Granted (a) 221.13 Vested ( 58 ) 99.41 Forfeited ( 8 ) 129.92 Nonvested balance, end of year $ 152.51"
      ],
      "table_11": [
        "• Office Commercial (Office 365 subscriptions, the Office 365 portion of Microsoft 365 Commercial subscriptions, and Office licensed on-premises), comprising Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business."
      ]
    },
    "table_count": 11,
    "word_count": 1014,
    "character_count": 5581,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "8",
      "original_length": 207647,
      "original_word_count": 28746,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/789019/000156459021039151/msft-10k_20210630.htm",
      "filing_date": "2021-07-29T16:21:55-04:00"
    }
  },
  "9A": {
    "section_name": "Controls and Procedures",
    "tables": {
      "table_1": [
        "for the year ended June 30, 2021, of the Company and our report dated July 29, 2021, expressed an unqualified opinion on those financial statements."
      ],
      "table_2": [
        "quarter ended June 30, 2021 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Deloitte & Touche LLP has audited our internal control over financial reporting as of June 30, 2021; their report is included in Item 9A."
      ],
      "table_3": [
        "June 30, 2021. There were no changes in our internal control over financial reporting during the quarter ended June 30, 2021 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Deloitte & Touche LLP has audited our internal control over financial reporting as of June 30, 2021; their report is included in Item 9A."
      ],
      "table_4": [
        "June 30, 2021, based on criteria established in Internal Control — Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of June 30, 2021, based on the criteria established in Internal Control — Integrated Framework (2013) issued by COSO."
      ],
      "table_5": [
        "June 30, 2021, of the Company and our report dated July 29, 2021, expressed an unqualified opinion on those financial statements."
      ],
      "table_6": [
        "assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements."
      ],
      "table_7": [
        "consolidated financial statements and the related notes (collectively referred to as the \"financial statements\") as of and for the year ended June 30, 2021, of the Company and our report dated July 29, 2021, expressed an unqualified opinion on those financial statements."
      ],
      "table_8": [
        "financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements."
      ]
    },
    "table_count": 8,
    "word_count": 464,
    "character_count": 3131,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "9A",
      "original_length": 6908,
      "original_word_count": 986,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/789019/000156459021039151/msft-10k_20210630.htm",
      "filing_date": "2021-07-29T16:21:55-04:00"
    }
  }
}