{
  "1A": {
    "section_name": "Risk Factors",
    "tables": {
      "balance_sheet_1": [
        "December 31, 2020, we and our subsidiaries had outstanding $10.57 billion in aggregate principal amount of indebtedness (see Note 12, Debt , to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K). Our substantial consolidated indebtedness may increase our vulnerability to any generally adverse economic and industry conditions. We and our subsidiaries may, subject to the limitations in the terms of our existing and future indebtedness, incur additional debt, secure existing or future debt or recapitalize our debt."
      ],
      "balance_sheet_2": [
        "assets including digital assets, gold bullion, gold exchange-traded funds and other assets as specified in the future. Thereafter, we invested an aggregate $1.50 billion in bitcoin under this policy and may acquire and hold digital assets from time to time or long-term. Moreover, we expect to begin accepting bitcoin as a form of payment for our products in the near future, subject to applicable laws and initially on a limited basis, which we may or may not liquidate upon receipt."
      ],
      "revenue_data_3": [
        "sales capabilities . We also frequently adjust our retail operations and product offerings in order to optimize our reach, costs, product line-up and model differentiation and customer experience. However, there is no guarantee that such steps will be accepted by consumers accustomed to traditional sales strategies. For example, marketing methods such as touchless test drives that we have pioneered in certain markets have not been proven at scale. We are targeting with Model 3 and Model Y a global mass demographic with a broad range of potential customers, in which we have relatively limited experience projecting demand and pricing our products. We currently produce numerous international variants at a limited number of factories, and if our specific demand expectations for these variants prove inaccurate, we may not be able to timely generate deliveries matched to the vehicles that we produce in the same timeframe or that are commensurate with the size of our operations in a given region. Likewise, as we develop and grow our energy products and services worldwide, our success will depend on our ability to correctly forecast demand in various markets."
      ],
      "revenue_data_4": [
        "Sales of vehicles in the automotive industry tend to be cyclical in many markets, which may expose us to further volatility as we expand and adjust our operations and retail strategies. Moreover, the COVID-19 pandemic may negatively impact the transportation and automotive industries long-term. It is uncertain as to how such macroeconomic factors will impact us as a company that has been experiencing growth and increasing market share in an industry that has globally been experiencing a recent decline in sales."
      ],
      "business_metrics_5": [
        "manufacturing facilities worldwide for a part of the first half of 2020. Some of our suppliers and partners also experienced temporary suspensions before resuming, including Panasonic, which manufactures battery cells for our products at our Gigafactory Nevada. We also instituted temporary employee furloughs and compensation reductions while our U.S. operations were scaled back. Reduced operations or closures at motor vehicle departments, vehicle auction houses and municipal and utility company inspectors have resulted in challenges in or postponements for our new vehicle deliveries, used vehicle sales and energy product deployments. Global trade conditions and consumer trends may further adversely impact us and our industries. For example, pandemic-related issues have exacerbated port congestion and intermittent supplier shutdowns and delays, resulting in additional expenses to expedite delivery of critical parts. Similarly, increased demand for personal electronics has created a shortfall of microchip supply, and it is yet unknown how we may be impacted. Sustaining our production trajectory will require the readiness and solvency of our suppliers and vendors, a stable and motivated production workforce and ongoing government cooperation, including for travel and visa allowances. The contingencies inherent in the construction of and ramp at new facilities such as Gigafactory Shanghai, Gigafactory Berlin and Gigafactory Texas may be exacerbated by these challenges."
      ],
      "business_metrics_6": [
        "production ramp delays for new products and features. For example, we encountered unanticipated supplier issues that led to delays during the ramp of Model X and experienced challenges with a supplier and with ramping full automation for certain of our initial Model 3 manufacturing processes. In addition, we may introduce in the future new or unique manufacturing processes and design features for our products. There is no guarantee that we will be able to successfully and timely introduce and scale such processes or features."
      ],
      "business_metrics_7": [
        "production of mass-market vehicles including Model 3 and Model Y, which we are planning to achieve through multiple factories worldwide. We have relatively limited experience to date in manufacturing Model 3 and Model Y at high volumes and even less experience building and ramping vehicle production lines across multiple factories in different geographies. In order to be successful, we will need to implement, maintain and ramp efficient and cost-effective manufacturing capabilities, processes and supply chains and achieve the design tolerances, high quality and output rates we have planned at our manufacturing facilities in California, Nevada, Texas, China and Germany. We will also need to hire, train and compensate skilled employees to operate these facilities. Bottlenecks and other unexpected challenges such as those we experienced in the past may arise during our production ramps, and we must address them promptly while continuing to improve manufacturing processes and reducing costs. If we are not successful in achieving these goals, we could face delays in establishing and/or sustaining our Model 3 and Model Y ramps or be unable to meet our related cost and profitability targets."
      ],
      "business_metrics_8": [
        "volumes, particularly in international markets requiring significant transit times. For example, we saw challenges in ramping our logistics channels in China and Europe to initially deliver Model 3 there in the first quarter of 2019. We have deployed a number of delivery models, such as deliveries to customers’ homes and workplaces and touchless deliveries, but there is no guarantee that such models will be scalable or be accepted globally. Likewise, as we ramp Solar Roof, we are working to substantially increase installation personnel and decrease installation times. If we are not successful in matching such capabilities with actual production, or if we experience unforeseen production delays or inaccurately forecast demand for the Solar Roof, our business, financial condition and operating results may be harmed."
      ],
      "business_metrics_9": [
        "capacity or servicing our vehicles efficiently, or experience unforeseen issues with the reliability of our vehicles, particularly higher-volume and newer additions to our fleet such as Model 3 and Model Y, it could overburden our servicing capabilities and parts inventory. Similarly, the increasing number of Tesla vehicles also requires us to continue to rapidly increase the number of our Supercharger stations and connectors throughout the world."
      ],
      "business_metrics_10": [
        "production delays, idle manufacturing facilities, product design changes and loss of access to important technology and tools for producing and supporting our products. Moreover, significant increases in our production, such as for Model 3 and Model Y, or product design changes by us have required and may in the future require us to procure additional components in a short amount of time. Our suppliers may not be willing or able to sustainably meet our timelines or our cost, quality and volume needs, or to do so may cost us more, which may require us to replace them with other sources. Finally, we have limited vehicle manufacturing experience outside of the Fremont Factory and we may experience issues increasing the level of localized procurement at our Gigafactory Shanghai and at future factories such as Gigafactory Berlin and Gigafactory Texas. While we believe that we will be able to secure additional or alternate sources or develop our own replacements for most of our components, there is no assurance that we will be able to do so quickly or at all. Additionally, we may be unsuccessful in our continuous efforts to negotiate with existing suppliers to obtain cost reductions and avoid unfavorable changes to terms, source less expensive suppliers for certain parts and redesign certain parts to make them less expensive to produce. Any of these occurrences may harm our business, prospects, financial condition and operating results."
      ],
      "business_metrics_11": [
        "volume and profitability of our vehicles and energy storage products depends on significant lithium-ion battery cell production by our partner Panasonic at Gigafactory Nevada. Although Panasonic has a long track record of producing high-quality cells at significant volume at its factories in Japan, it has relatively limited experience with cell production at Gigafactory Nevada , which began in 2017. Moreover, although Panasonic is co-located with us at Gigafactory Nevada, it is free to make its own operational decisions, such as its determination to temporarily suspend its manufacturing there in response to the COVID-19 pandemic. In addition, we produce several vehicle components, such as battery modules and packs incorporating the cells produced by Panasonic for Model 3 and Model Y and drive units (including to support Gigafactory Shanghai production), at Gigafactory Nevada, and we also manufacture energy storage products there. In the past, some of the manufacturing lines for certain product components took longer than anticipated to ramp to their full capacity, and additional bottlenecks may arise in the future as we continue to increase the production rate and introduce new lines. If we or Panasonic are unable to or otherwise do not maintain and grow our respective operations at Gigafactory Nevada production, or if we are unable to do so cost-effectively or hire and retain highly-skilled personnel there, our ability to manufacture our products profitably would be limited, which may harm our business and operating results."
      ],
      "business_metrics_12": [
        "manufacturing defects that cause them not to perform as expected or that require repair, or certain features of our vehicles such as new Autopilot or FSD features take longer than expected to become enabled, are legally restricted or become subject to onerous regulation, our ability to develop, market and sell our products and services may be harmed, and we may experience delivery delays, product recalls, product liability, breach of warranty and consumer protection claims and significant warranty and other expenses . In particular, our products are highly dependent on software, which is inherently complex and may contain latent defects or errors or be subject to external attacks. Issues experienced by our customers have included those related to the Model S and Model X 17-inch display screen, the panoramic roof and the 12-volt battery in the Model S, the seats and doors in the Model X and the operation of solar panels installed by us. Although we attempt to remedy any issues we observe in our products as effectively and rapidly as possible, such efforts may not be timely, may hamper production or may not completely satisfy our customers. While we have performed extensive internal testing on our products and features, we currently have a limited frame of reference by which to evaluate their long-term quality, reliability, durability and performance characteristics. There can be no assurance that we will be able to detect and fix any defects in our products prior to their sale to or installation for customers."
      ],
      "business_metrics_13": [
        "production of our Solar Roof and other solar products and components, energy storage components and Supercharger components, and for other lessor-approved functions. Under this agreement, we are obligated to, among other things, meet employment targets as well as specified minimum numbers of personnel in the State of New York and in Buffalo, New York and spend or incur $5.00 billion in combined capital, operational expenses, costs of goods sold and other costs in the State of New York during the 10-year period beginning April 30, 2018. As we temporarily suspended most of our manufacturing operations at Gigafactory New York pursuant to a New York State executive order issued in March 2020 as a result of the COVID-19 pandemic, we were granted a one-year deferral of our obligation to be compliant with our applicable targets under such agreement on April 30, 2020, which was memorialized in an amendment to our agreement with the SUNY Foundation in July 2020. While we expect to have and grow significant operations at Gigafactory New York and the surrounding Buffalo area, any failure by us in any year over the course of the term of the agreement to meet all applicable future obligations may result in our obligation to pay a “program payment” of $41 million to the SUNY Foundation for such year, the termination of our lease at Gigafactory New York which may require us to pay additional penalties and/or the need to adjust certain of our operations, in particular our production ramp of the Solar Roof or other components. Any of the foregoing events may harm our business, financial condition and operating results."
      ],
      "business_metrics_14": [
        "manufacturing engineering and electrical and building construction expertise. Moreover, we may be impacted by perceptions relating to reductions in force that we have conducted in the past in order to optimize our organizational structure and reduce costs and the departure of certain senior personnel for various reasons. Likewise, as a result of our temporary suspension of various U.S. manufacturing operations in the first half of 2020, in April 2020 we temporarily furloughed certain hourly employees and reduced most salaried employees’ base salaries. We also compete with both mature and prosperous companies that have far greater financial resources than we do and start-ups and emerging companies that promise short-term growth opportunities."
      ],
      "business_metrics_15": [
        "production facilities may be seriously damaged, or we may have to stop or delay production and shipment of our products. In addition, the global COVID-19 pandemic has impacted economic markets, manufacturing operations, supply chains, employment and consumer behavior in nearly every geographic region and industry across the world, and we have been, and may in the future be, adversely affected as a result. We may incur expenses or delays relating to such events outside of our control, which could have a material adverse impact on our business, operating results and financial condition."
      ],
      "business_metrics_16": [
        "employees to operate these facilities. Bottlenecks and other unexpected challenges such as those we experienced in the past may arise during our production ramps, and we must address them promptly while continuing to improve manufacturing processes and reducing costs. If we are not successful in achieving these goals, we could face delays in establishing and/or sustaining our Model 3 and Model Y ramps or be unable to meet our related cost and profitability targets."
      ],
      "business_metrics_17": [
        "customers. While we have improved our delivery logistics, we may face difficulties with deliveries at increasing volumes, particularly in international markets requiring significant transit times. For example, we saw challenges in ramping our logistics channels in China and Europe to initially deliver Model 3 there in the first quarter of 2019. We have deployed a number of delivery models, such as deliveries to customers’ homes and workplaces and touchless deliveries, but there is no guarantee that such models will be scalable or be accepted globally. Likewise, as we ramp Solar Roof, we are working to substantially increase installation personnel and decrease installation times. If we are not successful in matching such capabilities with actual production, or if we experience unforeseen production delays or inaccurately forecast demand for the Solar Roof, our business, financial condition and operating results may be harmed."
      ],
      "business_metrics_18": [
        "customers have included those related to the Model S and Model X 17-inch display screen, the panoramic roof and the 12-volt battery in the Model S, the seats and doors in the Model X and the operation of solar panels installed by us. Although we attempt to remedy any issues we observe in our products as effectively and rapidly as possible, such efforts may not be timely, may hamper production or may not completely satisfy our customers. While we have performed extensive internal testing on our products and features, we currently have a limited frame of reference by which to evaluate their long-term quality, reliability, durability and performance characteristics. There can be no assurance that we will be able to detect and fix any defects in our products prior to their sale to or installation for customers."
      ],
      "business_metrics_19": [
        "Employees may leave Tesla or choose other employers over Tesla due to various factors, such as a very competitive labor market for talented individuals with automotive or technology experience, or any negative publicity related to us. In California, Nevada and other regions where we have operations, there is increasing competition for individuals with skillsets needed for our business, including specialized knowledge of electric vehicles, software engineering, manufacturing engineering and electrical and building construction expertise. Moreover, we may be impacted by perceptions relating to reductions in force that we have conducted in the past in order to optimize our organizational structure and reduce costs and the departure of certain senior personnel for various reasons. Likewise, as a result of our temporary suspension of various U.S. manufacturing operations in the first half of 2020, in April 2020 we temporarily furloughed certain hourly employees and reduced most salaried employees’ base salaries. We also compete with both mature and prosperous companies that have far greater financial resources than we do and start-ups and emerging companies that promise short-term growth opportunities."
      ],
      "business_metrics_20": [
        "employees of certain trades at companies such as us to belong to a union, which can result in higher employee costs and increased risk of work stoppages. Moreover, regulations in some jurisdictions outside of the U.S. mandate employee participation in industrial collective bargaining agreements and work councils with certain consultation rights with respect to the relevant companies’ operations. Although we work diligently to provide the best possible work environment for our employees, they may still decide to join or seek recognition to form a labor union, or we may be required to become a union signatory. From time to time, labor unions have engaged in campaigns to organize certain of our operations, as part of which such unions have filed unfair labor practice charges against us with the National Labor Relations Board, and they may do so in the future. In September 2019, an administrative law judge issued a recommended decision for Tesla on certain issues and against us on certain others. The National Labor Relations Board has not yet adopted the recommendation and we have appealed certain aspects of the recommended decision. Any unfavorable ultimate outcome for Tesla may have a negative impact on the perception of Tesla’s treatment of our employees. Furthermore, we are directly or indirectly dependent upon companies with unionized work forces, such as suppliers and trucking and freight companies. Any work stoppages or strikes organized by such unions could delay the manufacture and sale of our products and may harm our business and operating results."
      ],
      "business_metrics_21": [
        "customers to buy our products and investors to invest in our solar financing funds. However, these incentives may expire when the allocated funding is exhausted, reduced or terminated as renewable energy adoption rates increase, sometimes without warning. For example, the U.S. federal government currently offers certain tax credits for the installation of solar power facilities and energy storage systems that are charged from a co-sited solar power facility; however, these tax credits are currently scheduled to decline and/or expire in 2023 and beyond. Likewise, in jurisdictions where net metering is currently available, our customers receive bill credits from utilities for energy that their solar energy systems generate and export to the grid in excess of the electric load they use. The benefit available under net metering has been or has been proposed to be reduced, altered or eliminated in several jurisdictions, and has also been contested and may continue to be contested before the FERC. Any reductions or terminations of such incentives may harm our business, prospects, financial condition and operating results by making our products less competitive for potential customers, increasing our cost of capital and adversely impacting our ability to attract investment partners and to form new financing funds for our solar and energy storage assets."
      ],
      "risk_factors_22": [
        "challenges with a supplier and with ramping full automation for certain of our initial Model 3 manufacturing processes. In addition, we may introduce in the future new or unique manufacturing processes and design features for our products. There is no guarantee that we will be able to successfully and timely introduce and scale such processes or features."
      ],
      "risk_factors_23": [
        "challenges such as those we experienced in the past may arise during our production ramps, and we must address them promptly while continuing to improve manufacturing processes and reducing costs. If we are not successful in achieving these goals, we could face delays in establishing and/or sustaining our Model 3 and Model Y ramps or be unable to meet our related cost and profitability targets."
      ],
      "risk_factors_24": [
        "challenges in ramping our logistics channels in China and Europe to initially deliver Model 3 there in the first quarter of 2019. We have deployed a number of delivery models, such as deliveries to customers’ homes and workplaces and touchless deliveries, but there is no guarantee that such models will be scalable or be accepted globally. Likewise, as we ramp Solar Roof, we are working to substantially increase installation personnel and decrease installation times. If we are not successful in matching such capabilities with actual production, or if we experience unforeseen production delays or inaccurately forecast demand for the Solar Roof, our business, financial condition and operating results may be harmed."
      ]
    },
    "table_count": 24,
    "word_count": 3499,
    "character_count": 22625,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "1A",
      "original_length": 84686,
      "original_word_count": 12935,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/1318605/000156459021004599/tsla-10k_20201231.htm",
      "filing_date": "2021-02-08T07:27:23-05:00"
    }
  },
  "7": {
    "section_name": "Management's Discussion and Analysis",
    "tables": {
      "table_1": [
        "Production Location Vehicle Model(s) Production Status Fremont Factory Model S and Model X Active Model 3 and Model Y Active Gigafactory Shanghai Model 3 and Model Y Active Gigafactory Berlin Model Y Constructing manufacturing facilities Gigafactory Texas Model Y Constructing manufacturing facilities Cybertruck In development TBD Tesla Semi In development Tesla Roadster In development"
      ],
      "table_2": [
        "Year Ended December 31, 2020 vs. 2019 Change 2019 vs. 2018 Change (Dollars in millions) $ % $ % Automotive sales $ 26,184 $ 19,952 $ 17,632 $ 6,232 % $ 2,320 % Automotive leasing 1,052 % (14 ) % Total automotive revenues 27,236 20,821 18,515 6,415 % 2,306 % Services and other 2,306 2,226 1,391 % % Total automotive & services and other segment revenue 29,542 23,047 19,906 6,495 % 3,141 % Energy generation and storage segment revenue 1,994 1,531 1,555 % (24 ) % Total revenues $ 31,536 $ 24,578 $ 21,461 $ 6,958 % $ 3,117 %"
      ],
      "table_3": [
        "Year Ended December 31, 2020 vs. 2019 Change 2019 vs. 2018 Change (Dollars in millions) $ % $ % Cost of revenues Automotive sales $ 19,696 $ 15,939 $ 13,686 $ 3,757 % $ 2,253 % Automotive leasing % (29 ) % Total automotive cost of revenues 20,259 16,398 14,174 3,861 % 2,224 % Services and other 2,671 2,770 1,880 (99 ) % % Total automotive & services and other segment cost of revenues 22,930 19,168 16,054 3,762 % 3,114 % Energy generation and storage segment 1,976 1,341 1,365 % (24 ) % Total cost of revenues $ 24,906 $ 20,509 $ 17,419 $ 4,397 % $ 3,090 % Gross profit total automotive $ 6,977 $ 4,423 $ 4,341 Gross margin total automotive % % % Gross profit total automotive & services and other segment $ 6,612 $ 3,879 $ 3,852 Gross margin total automotive & services and other segment % % % Gross profit energy generation and storage segment $ $ $ Gross margin energy generation and storage segment % % % Total gross profit $ 6,630 $ 4,069 $ 4,042 Total gross margin % % %"
      ],
      "table_4": [
        "Year Ended December 31, 2020 vs. 2019 Change 2019 vs. 2018 Change (Dollars in millions) $ % $ % Research and development $ 1,491 $ 1,343 $ 1,460 $ % $ (117 ) % As a percentage of revenues % % %"
      ],
      "table_5": [
        "Year Ended December 31, 2020 vs. 2019 Change 2019 vs. 2018 Change (Dollars in millions) $ % $ % Selling, general and administrative $ 3,145 $ 2,646 $ 2,835 $ % $ (189 ) % As a percentage of revenues % % %"
      ],
      "table_6": [
        "Year Ended December 31, 2020 vs. 2019 Change 2019 vs. 2018 Change (Dollars in millions) $ % $ % Restructuring and other $ — $ $ $ (149 ) -100% $ 10% As a percentage of revenues % % %"
      ],
      "table_7": [
        "Year Ended December 31, 2020 vs. 2019 Change 2019 vs. 2018 Change (Dollars in millions) $ % $ % Interest expense $ (748 ) $ (685 ) $ (663 ) $ (63 ) % $ (22 ) % As a percentage of revenues % % %"
      ],
      "table_8": [
        "Year Ended December 31, 2020 vs. 2019 Change 2019 vs. 2018 Change (Dollars in millions) $ % $ % Other (expense) income, net $ (122 ) $ $ $ (167 ) Not meaningful $ 105% As a percentage of revenues % % %"
      ],
      "table_9": [
        "Year Ended December 31, 2020 vs. 2019 Change 2019 vs. 2018 Change (Dollars in millions) $ % $ % Provision for income taxes $ $ $ $ % $ % Effective tax rate % % %"
      ],
      "table_10": [
        "Year Ended December 31, 2020 vs. 2019 Change 2019 vs. 2018 Change (Dollars in millions) $ % $ % Net income (loss) attributable to noncontrolling interests and redeemable noncontrolling interests in subsidiaries $ $ $ (87 ) $ 62% $ Not meaningful"
      ],
      "table_11": [
        "Year Ended December 31, (Dollars in millions) Net cash provided by operating activities $ 5,943 $ 2,405 $ 2,098 Net cash used in investing activities $ (3,132 ) $ (1,436 ) $ (2,337 ) Net cash provided by financing activities $ 9,973 $ 1,529 $"
      ],
      "table_12": [
        "Year Ended December 31, Total Thereafter Operating lease obligations, including imputed interest $ 1,846 $ $ $ $ $ $ Finance lease obligations, including imputed interest 1,635 Purchase obligations (1) 18,318 10,483 2,743 2,280 1,877 Debt, including scheduled interest (2) 11,695 2,100 2,172 2,602 2,021 2,109 Total $ 33,494 $ 13,411 $ 5,688 $ 5,573 $ 4,442 $ 3,187 $ 1,193"
      ]
    },
    "table_count": 12,
    "word_count": 740,
    "character_count": 3896,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "7",
      "original_length": 99013,
      "original_word_count": 14848,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/1318605/000156459021004599/tsla-10k_20201231.htm",
      "filing_date": "2021-02-08T07:27:23-05:00"
    }
  },
  "8": {
    "section_name": "Financial Statements and Supplementary Data",
    "tables": {
      "table_1": [
        "December 31, December 31, Assets Current assets Cash and cash equivalents $ 19,384 $ 6,268 Accounts receivable, net 1,886 1,324 Inventory 4,101 3,552 Prepaid expenses and other current assets 1,346 Total current assets 26,717 12,103 Operating lease vehicles, net 3,091 2,447 Solar energy systems, net 5,979 6,138 Property, plant and equipment, net 12,747 10,396 Operating lease right-of-use assets 1,558 1,218 Intangible assets, net Goodwill Other non-current assets 1,536 1,470 Total assets $ 52,148 $ 34,309 Liabilities Current liabilities Accounts payable $ 6,051 $ 3,771 Accrued liabilities and other 3,855 3,222 Deferred revenue 1,458 1,163 Customer deposits Current portion of debt and finance leases 2,132 1,785 Total current liabilities 14,248 10,667 Debt and finance leases, net of current portion 9,556 11,634 Deferred revenue, net of current portion 1,284 1,207 Other long-term liabilities 3,330 2,691 Total liabilities 28,418 26,199 Commitments and contingencies (Note 16) Redeemable noncontrolling interests in subsidiaries Convertible senior notes (Note 12) — Equity Stockholders' equity Preferred stock; $ 0.001 par value; 100 shares authorized; no shares issued and outstanding — — Common stock; $ 0.001 par value; 2,000 shares authorized; 960 and 905 shares issued and outstanding as of December 31, 2020 and December 31, 2019, respectively (1) Additional paid-in capital (1) 27,260 12,736 Accumulated other comprehensive income (loss) ( 36 ) Accumulated deficit ( 5,399 ) ( 6,083 ) Total stockholders' equity 22,225 6,618 Noncontrolling interests in subsidiaries Total liabilities and equity $ 52,148 $ 34,309"
      ],
      "table_2": [
        "Year Ended December 31, Revenues Automotive sales $ 26,184 $ 19,952 $ 17,632 Automotive leasing 1,052 Total automotive revenues 27,236 20,821 18,515 Energy generation and storage 1,994 1,531 1,555 Services and other 2,306 2,226 1,391 Total revenues 31,536 24,578 21,461 Cost of revenues Automotive sales 19,696 15,939 13,686 Automotive leasing Total automotive cost of revenues 20,259 16,398 14,174 Energy generation and storage 1,976 1,341 1,365 Services and other 2,671 2,770 1,880 Total cost of revenues 24,906 20,509 17,419 Gross profit 6,630 4,069 4,042 Operating expenses Research and development 1,491 1,343 1,460 Selling, general and administrative 3,145 2,646 2,835 Restructuring and other — Total operating expenses 4,636 4,138 4,430 Income (loss) from operations 1,994 ( 69 ) ( 388 ) Interest income Interest expense ( 748 ) ( 685 ) ( 663 ) Other (expense) income, net ( 122 ) Income (loss) before income taxes 1,154 ( 665 ) ( 1,005 ) Provision for income taxes Net income (loss) ( 775 ) ( 1,063 ) Net income (loss) attributable to noncontrolling interests and redeemable noncontrolling interests in subsidiaries ( 87 ) Net income (loss) attributable to common stockholders $ $ ( 862 ) $ ( 976 ) Less: Buy-out of noncontrolling interest — Net income (loss) used in computing net income (loss) per share of common stock $ $ ( 870 ) $ ( 976 ) Net income (loss) per share of common stock attributable to common stockholders (1) Basic $ 0.74 $ ( 0.98 ) $ ( 1.14 ) Diluted $ 0.64 $ ( 0.98 ) $ ( 1.14 ) Weighted average shares used in computing net income (loss) per share of common stock (1) Basic Diluted 1,083"
      ],
      "table_3": [
        "Year Ended December 31, Net income (loss) $ $ ( 775 ) $ ( 1,063 ) Other comprehensive income (loss): Foreign currency translation adjustment ( 28 ) ( 42 ) Comprehensive income (loss) 1,261 ( 803 ) ( 1,105 ) Less: Comprehensive income (loss) attributable to noncontrolling interests and redeemable noncontrolling interests in subsidiaries ( 87 ) Comprehensive income (loss) attributable to common stockholders $ 1,120 $ ( 890 ) $ ( 1,018 )"
      ],
      "table_4": [
        "Accumulated Redeemable Additional Other Total Noncontrolling Noncontrolling Common Stock Paid-In Accumulated Comprehensive Stockholders' Interests in Total Interests Shares (1) Amount (1) Capital (1) Deficit Income (Loss) Equity Subsidiaries Equity Balance as of December 31, 2017 $ $ $ 9,177 $ ( 4,974 ) $ $ 4,237 $ $ 5,234 Adjustments for prior periods from adopting ASC 606 — — — — ( 89 ) Adjustments for prior periods from adopting Accounting Standards Update No. 2017-05 — — — — — — Exercises of conversion feature of convertible senior notes — — — — Issuance of common stock for equity incentive awards — — — — Stock-based compensation — — — — — — Contributions from noncontrolling interests — — — — — — Distributions to noncontrolling interests ( 61 ) — — — — — — ( 210 ) ( 210 ) Other ( 3 ) — — — — — — — — Net loss ( 62 ) — — — ( 976 ) — ( 976 ) ( 25 ) ( 1,001 ) Other comprehensive loss — — — — — ( 41 ) ( 41 ) — ( 41 ) Balance as of December 31, 2018 $ $ $ 10,248 $ ( 5,318 ) $ ( 8 ) $ 4,923 $ $ 5,757 Adjustments for prior periods from adopting ASC 842 — — — — — — Conversion feature of 2.00 % Convertible Senior Notes due in 2024 (\"2024 Notes\") — — — — — — Purchase of convertible note hedges — — — ( 476 ) — — ( 476 ) — ( 476 ) Sales of warrants — — — — — — Issuance of common stock for equity incentive awards and acquisitions, net of transaction costs — — — — Issuance of common stock in May 2019 public offering at $ 48.60 per share (1), net of issuance costs of $ 15 — — — — Stock-based compensation — — — — — — Contributions from noncontrolling interests — — — — — — Distributions to noncontrolling interests ( 65 ) — — — — — — ( 198 ) ( 198 ) Other ( 1 ) — — ( 4 ) — — ( 4 ) — ( 4 ) Net income (loss) — — — ( 862 ) — ( 862 ) ( 823 ) Other comprehensive loss — — — — — ( 28 ) ( 28 ) — ( 28 ) Balance as of December 31, 2019 $ $ $ 12,736 $ ( 6,083 ) $ ( 36 ) $ 6,618 $ $ 7,467 Adjustments for prior periods from adopting ASU 2016-13 — — — ( 37 ) — ( 37 ) — ( 37 ) Reclassification between equity and mezzanine equity for convertible senior notes — — — ( 51 ) — — ( 51 ) — ( 51 ) Exercises of conversion feature of convertible senior notes — — — — Issuance of common stock for equity incentive awards — — — — Issuance of common stock in public offerings, net of issuance costs of $68 (1) — 12,269 — — 12,269 — 12,269 Stock-based compensation — — — 1,861 — — 1,861 — 1,861 Contributions from noncontrolling interests — — — — — — Distributions to noncontrolling interests ( 67 ) — — — — — — ( 132 ) ( 132 ) Buy-outs of noncontrolling interests ( 4 ) — — ( 31 ) — — ( 31 ) — ( 31 ) Net income — — — — Other comprehensive income — — — — — — Balance as of December 31, 2020 $ $ $ 27,260 $ ( 5,399 ) $ $ 22,225 $ $ 23,075"
      ],
      "table_5": [
        "Year Ended December 31, Cash Flows from Operating Activities Net income (loss) $ $ ( 775 ) $ ( 1,063 ) Adjustments to reconcile net income (loss) to net cash provided by operating activities: Depreciation, amortization and impairment 2,322 2,154 1,901 Stock-based compensation 1,734 Amortization of debt discounts and issuance costs Inventory and purchase commitments write-downs Loss on disposals of fixed assets Foreign currency transaction net loss (gain) ( 48 ) ( 2 ) Non-cash interest and other operating activities Operating cash flow related to repayment of discounted convertible senior notes — ( 188 ) — Changes in operating assets and liabilities, net of effect of business combinations: Accounts receivable ( 652 ) ( 367 ) ( 497 ) Inventory ( 422 ) ( 429 ) ( 1,023 ) Operating lease vehicles ( 1,072 ) ( 764 ) ( 215 ) Prepaid expenses and other current assets ( 251 ) ( 288 ) ( 82 ) Other non-current assets ( 344 ) ( 207 ) Accounts payable and accrued liabilities 2,102 1,797 Deferred revenue Customer deposits ( 58 ) ( 96 ) Other long-term liabilities ( 5 ) ( 25 ) Net cash provided by operating activities 5,943 2,405 2,098 Cash Flows from Investing Activities Purchases of property and equipment excluding finance leases, net of sales ( 3,157 ) ( 1,327 ) ( 2,101 ) Purchases of solar energy systems, net of sales ( 75 ) ( 105 ) ( 218 ) Receipt of government grants — Purchase of intangible assets ( 10 ) ( 5 ) — Business combinations, net of cash acquired ( 13 ) ( 45 ) ( 18 ) Net cash used in investing activities ( 3,132 ) ( 1,436 ) ( 2,337 ) Cash Flows from Financing Activities Proceeds from issuances of common stock in public offerings, net of issuance costs 12,269 — Proceeds from issuances of convertible and other debt 9,713 10,669 6,176 Repayments of convertible and other debt ( 11,623 ) ( 9,161 ) ( 5,247 ) Repayments of borrowings issued to related parties — — ( 100 ) Collateralized lease repayments ( 240 ) ( 389 ) ( 559 ) Proceeds from exercises of stock options and other stock issuances Principal payments on finance leases ( 338 ) ( 321 ) ( 181 ) Debt issuance costs ( 6 ) ( 37 ) ( 15 ) Purchase of convertible note hedges — ( 476 ) — Proceeds from issuance of warrants — — Proceeds from investments by noncontrolling interests in subsidiaries Distributions paid to noncontrolling interests in subsidiaries ( 208 ) ( 311 ) ( 227 ) Payments for buy-outs of noncontrolling interests in subsidiaries ( 35 ) ( 9 ) ( 6 ) Net cash provided by financing activities 9,973 1,529 Effect of exchange rate changes on cash and cash equivalents and restricted cash ( 23 ) Net increase in cash and cash equivalents and restricted cash 13,118 2,506 Cash and cash equivalents and restricted cash, beginning of period 6,783 4,277 3,965 Cash and cash equivalents and restricted cash, end of period $ 19,901 $ 6,783 $ 4,277 Supplemental Non-Cash Investing and Financing Activities Equity issued in connection with business combination $ — $ $ — Acquisitions of property and equipment included in liabilities $ 1,088 $ $ Estimated fair value of facilities under build-to-suit leases $ — $ — $ Supplemental Disclosures Cash paid during the period for interest, net of amounts capitalized $ $ $ Cash paid during the period for taxes, net of refunds $ $ $"
      ],
      "table_6": [
        "Year Ended December 31, Automotive sales without resale value guarantee $ 24,053 $ 19,212 $ 15,810 Automotive sales with resale value guarantee (1) 1,403 Automotive regulatory credits 1,580 Energy generation and storage sales 1,477 1,000 1,056 Services and other 2,306 2,226 1,391 Total revenues from sales and services 29,967 23,178 20,079 Automotive leasing 1,052 Energy generation and storage leasing Total revenues $ 31,536 $ 24,578 $ 21,461"
      ],
      "table_7": [
        "Year ended December 31, Deferred revenue on automotive sales with and without resale value guarantee— beginning of period $ 1,472 $ Additions Net changes in liability for pre-existing contracts Revenue recognized ( 326 ) ( 300 ) Deferred revenue on automotive sales with and without resale value guarantee— end of period $ 1,926 $ 1,472"
      ],
      "table_8": [
        "Year Ended December 31, Weighted average shares used in computing net income (loss) per share of common stock, basic Add: Stock-based awards — — Convertible senior notes — — Warrants — — Weighted average shares used in computing net income (loss) per share of common stock, diluted 1,083"
      ],
      "table_9": [
        "December 31, December 31, December 31, Cash and cash equivalents $ 19,384 $ 6,268 $ 3,686 Restricted cash included in prepaid expenses and other current assets Restricted cash included in other non-current assets Total as presented in the consolidated statements of cash flows $ 19,901 $ 6,783 $ 4,277"
      ],
      "table_10": [
        "Solar energy systems in service 30 to 35 years Initial direct costs related to customer solar energy system lease acquisition costs Lease term (up to 25 years)"
      ],
      "table_11": [
        "Year Ended December 31, Accrued warranty—beginning of period $ 1,089 $ $ Warranty costs incurred ( 312 ) ( 250 ) ( 209 ) Net changes in liability for pre-existing warranties, including expirations and foreign exchange impact ( 26 ) Additional warranty accrued from adoption of ASC 606 — — Provision for warranty Accrued warranty—end of period $ 1,468 $ 1,089 $"
      ],
      "table_12": [
        "Assets acquired: Cash and cash equivalents $ Accounts receivable Inventory Property, plant and equipment, net Operating lease right-of-use assets Intangible assets Prepaid expenses and other assets, current and non-current Total assets acquired Liabilities and equity assumed: Accounts payable ( 10 ) Accrued liabilities and other ( 28 ) Debt and finance leases, current and non-current ( 44 ) Deferred revenue, current ( 1 ) Other long-term liabilities ( 14 ) Additional paid-in capital ( 8 ) Total liabilities and equity assumed ( 105 ) Net assets acquired Goodwill Total purchase price $"
      ],
      "table_13": [
        "December 31, 2020 December 31, 2019 Gross Carrying Amount Accumulated Amortization Other Net Carrying Amount Gross Carrying Amount Accumulated Amortization Other Net Carrying Amount Finite-lived intangible assets: Developed technology $ $ ( 111 ) $ $ $ $ ( 72 ) $ $ Trade names ( 1 ) — ( 1 ) Favorable contracts and leases, net ( 32 ) — ( 24 ) — Other ( 18 ) ( 16 ) — Total finite-lived intangible assets ( 162 ) ( 113 ) Indefinite-lived intangible assets: Gigafactory Nevada water rights — — — — In-process research and development (\"IPR&D\") — — — — — ( 60 ) — Total infinite-lived intangible assets — — — ( 60 ) Total intangible assets $ $ ( 162 ) $ $ $ $ ( 113 ) $ ( 58 ) $"
      ],
      "table_14": [
        "December 31, 2020 December 31, 2019 Fair Value Level I Level II Level III Fair Value Level I Level II Level III Money market funds (cash and cash equivalents) $ 13,847 $ 13,847 $ — $ — $ 1,632 $ 1,632 $ — $ — Interest rate swap assets — — — — — — Interest rate swap liabilities — — ( 27 ) — ( 27 ) — Total $ 13,905 $ 13,847 $ $ — $ 1,606 $ 1,632 $ ( 26 ) $ —"
      ],
      "table_15": [
        "December 31, 2020 December 31, 2019 Aggregate Notional Amount Gross Asset at Fair Value Gross Liability at Fair Value Aggregate Notional Amount Gross Asset at Fair Value Gross Liability at Fair Value Interest rate swaps $ $ — $ $ $ $"
      ],
      "table_16": [
        "December 31, 2020 December 31, 2019 Carrying Value Fair Value Carrying Value Fair Value Convertible Senior Notes $ 1,971 $ 24,596 $ 3,729 $ 6,110 2025 Notes $ 1,785 $ 1,877 $ 1,782 $ 1,748 Solar asset-backed notes $ 1,115 $ 1,137 $ 1,155 $ 1,211 Solar loan-backed notes $ $ $ $"
      ],
      "table_17": [
        "December 31, December 31, Raw materials $ 1,508 $ 1,428 Work in process Finished goods (1) 1,666 1,356 Service parts Total $ 4,101 $ 3,552"
      ],
      "table_18": [
        "December 31, December 31, Solar energy systems in service $ 6,758 $ 6,682 Initial direct costs related to customer solar energy system lease acquisition costs 6,861 6,784 Less: accumulated depreciation and amortization (1) ( 955 ) ( 723 ) 5,906 6,061 Solar energy systems under construction Solar energy systems pending interconnection Solar energy systems, net (2) $ 5,979 $ 6,138"
      ],
      "table_19": [
        "December 31, December 31, Machinery, equipment, vehicles and office furniture $ 8,493 $ 7,167 Tooling 1,811 1,493 Leasehold improvements 1,421 1,087 Land and buildings 3,662 3,024 Computer equipment, hardware and software Construction in progress 1,621 17,864 14,130 Less: Accumulated depreciation ( 5,117 ) ( 3,734 ) Total $ 12,747 $ 10,396"
      ],
      "table_20": [
        "December 31, December 31, Accrued purchases (1) $ $ Taxes payable (2) Payroll and related costs Accrued warranty reserve, current portion Sales return reserve, current portion Operating lease liabilities, current portion Accrued interest Resale value guarantees, current portion Other current liabilities Total $ 3,855 $ 3,222"
      ],
      "table_21": [
        "December 31, December 31, Operating lease liabilities $ 1,254 $ Accrued warranty reserve Sales return reserve Deferred tax liability Resale value guarantees Other non-current liabilities Total other long-term liabilities $ 3,330 $ 2,691"
      ],
      "table_22": [
        "Unpaid Unused Net Carrying Value Principal Committed Contractual Contractual Current Long-Term Balance Amount (1) Interest Rates Maturity Date Recourse debt: 2021 Notes $ — — 1.25 % March 2021 2022 Notes — 2.375 % March 2022 2024 Notes 1,282 — 2.00 % May 2024 2025 Notes — 1,785 1,800 — 5.30 % August 2025 Credit Agreement — 1,895 1,895 3.3 % July 2023 Solar Bonds and other Loans — 3.6%-5.8 % January 2021 - January 2031 Total recourse debt 4,951 5,957 Non-recourse debt: Automotive Asset-backed Notes 1,705 — 0.6%-7.9 % August 2021-August 2024 Solar Asset-backed Notes 1,076 1,141 — 3.0%-7.7 % September 2024-February 2048 China Loan Agreements — 1,372 4.0 % June 2021-December 2024 Cash Equity Debt — 5.3%-5.8 % July 2033-January 2035 Solar Loan-backed Notes — 4.8%-7.5 % September 2048-September 2049 Warehouse Agreements 1.7%-1.8 % September 2022 Solar Term Loan — — 3.7 % January 2021 Automotive Lease-backed Credit Facilities 1.9%-5.9 % September 2022-November 2022 Solar Revolving Credit Facility and other Loans — 2.7%-5.1 % June 2022-February 2033 Total non-recourse debt 1,049 3,511 4,612 2,354 Total debt 1,758 8,462 $ 10,569 $ 2,632 Finance leases 1,094 Total debt and finance leases $ 2,132 $ 9,556"
      ],
      "table_23": [
        "Unpaid Unused Net Carrying Value Principal Committed Contractual Contractual Current Long-Term Balance Amount (1) Interest Rates Maturity Date Recourse debt: 2021 Notes $ — $ 1,304 $ 1,380 $ — 1.25 % March 2021 2022 Notes — — 2.375 % March 2022 2024 Notes — 1,383 1,840 — 2.00 % May 2024 2025 Notes — 1,782 1,800 — 5.3 % August 2025 Credit Agreement 1,586 1,727 2.7%-4.8 % June 2020-July 2023 Zero-Coupon Convertible Senior Notes due in 2020 — — 0.0 % December 2020 Solar Bonds and other Loans — 3.6%-5.8 % March 2020-January 2031 Total recourse debt 7,010 7,898 Non-recourse debt: Automotive Asset-backed Notes 1,577 — 2.0%-7.9 % February 2020- May 2023 Solar Asset-backed Notes 1,123 1,183 — 4.0%-7.7 % September 2024-February 2048 China Loan Agreements 1,542 3.7%-4.0 % September 2020-December 2024 Cash Equity Debt — 5.3%-5.8 % July 2033-January 2035 Solar Loan-backed Notes — 4.8%-7.5 % September 2048-September 2049 Warehouse Agreements 3.1%-3.6 % September 2021 Solar Term Loans — 5.4 % January 2021 Automotive Lease-backed Credit Facility — 4.2%-5.9 % November 2022 Solar Revolving Credit Facility and other Loans 4.5%-7.4 % March 2020-June 2022 Total non-recourse debt 1,146 3,392 4,594 2,481 Total debt 1,399 10,402 $ 12,492 $ 2,980 Finance leases 1,232 Total debt and finance leases $ 1,785 $ 11,634"
      ],
      "table_24": [
        "Year Ended December 31, Contractual interest coupon $ $ $ Amortization of debt issuance costs Amortization of debt discounts Losses on extinguishment of debt — — Total $ $ $"
      ],
      "table_25": [
        "Recourse debt Non-recourse debt Total $ $ 1,058 $ 1,818 1,508 1,935 1,895 2,406 1,068 1,851 1,804 1,979 Thereafter Total $ 5,957 $ 4,612 $ 10,569"
      ],
      "table_26": [
        "December 31, 2020 December 31, 2019 Operating leases: Operating lease right-of-use assets $ 1,558 $ 1,218 Accrued liabilities and other $ $ Other long-term liabilities 1,254 Total operating lease liabilities $ 1,540 $ 1,184 Finance leases: Solar energy systems, net $ $ Property, plant and equipment, net 1,465 1,600 Total finance lease assets $ 1,494 $ 1,630 Current portion of long-term debt and finance leases $ $ Long-term debt and finance leases, net of current portion 1,094 1,232 Total finance lease liabilities $ 1,468 $ 1,618"
      ],
      "table_27": [
        "Year Ended December 31, 2020 December 31, 2019 Operating lease expense: Operating lease expense (1) $ $ Finance lease expense: Amortization of leased assets $ $ Interest on lease liabilities Total finance lease expense $ $ Total lease expense $ $"
      ],
      "table_28": [
        "December 31, 2020 December 31, 2019 Weighted-average remaining lease term: Operating leases 6.2 years 6.2 years Finance leases 4.9 years 3.9 years Weighted-average discount rate: Operating leases 5.8 % 6.5 % Finance leases 6.5 % 6.5 %"
      ],
      "table_29": [
        "Year Ended December 31, 2020 December 31, 2019 Cash paid for amounts included in the measurement of lease liabilities: Operating cash outflows from operating leases $ $ Operating cash outflows from finance leases (interest payments) $ $ Financing cash outflows from finance leases $ $ Leased assets obtained in exchange for finance lease liabilities $ $ Leased assets obtained in exchange for operating lease liabilities $ $"
      ],
      "table_30": [
        "December 31, Gross lease receivables $ Unearned interest income ( 11 ) Net investment in sales-type leases $ Reported as: Prepaid expenses and other current assets $ Other assets Net investment in sales-type leases $"
      ],
      "table_31": [
        "Stock Options RSUs Weighted- Weighted- Weighted- Average Aggregate Average Number of Average Remaining Intrinsic Number Grant Options Exercise Contractual Value of RSUs Date Fair (in thousands) Price Life (years) (in billions) (in thousands) Value Balance, December 31, 2019 (1) 149,974 $ 55.90 24,031 $ 58.21 Granted 4,780 $ 421.73 6,876 $ 300.51 Exercised or released ( 6,815 ) $ 44.11 ( 9,620 ) $ 72.26 Cancelled ( 1,006 ) $ 68.67 ( 2,498 ) $ 82.31 Balance, December 31, 2020 146,933 $ 68.26 6.08 $ 93.66 18,789 $ 136.49 Vested and expected to vest, December 31, 2020 101,617 $ 69.04 5.80 $ 64.69 18,778 $ 136.53 Exercisable and vested, December 31, 2020 66,205 $ 46.88 4.89 $ 43.61"
      ],
      "table_32": [
        "Year Ended December 31, Risk-free interest rate 0.26 % 2.4 % 2.5 % Expected term (in years) 3.9 4.5 4.7 Expected volatility % % % Dividend yield 0.0 % 0.0 % 0.0 % Grant date fair value per share (1) $ 216.14 $ 22.32 $ 24.38"
      ],
      "table_33": [
        "Total Annualized Revenue Annualized Adjusted EBITDA Milestone (in billions) Achievement Status Milestone (in billions) Achievement Status $ 20.0 Achieved and certified $ 1.5 Achieved and certified $ 35.0 Probable $ 3.0 Achieved and certified $ 55.0 - $ 4.5 Achieved and certified $ 75.0 - $ 6.0 Probable $ 100.0 - $ 8.0 Probable $ 125.0 - $ 10.0 - $ 150.0 - $ 12.0 - $ 175.0 - $ 14.0 -"
      ],
      "table_34": [
        "• 1/4th of each award vests upon achieving an annualized gross margin of greater than 30 % for any three-year period."
      ],
      "table_35": [
        "• Aggregate production of 100,000 vehicles in a trailing 12-month period."
      ],
      "table_36": [
        "Year Ended December 31, Cost of revenues $ $ $ Research and development Selling, general and administrative 1,107 Restructuring and other — Total $ 1,734 $ $"
      ],
      "table_37": [
        "Year Ended December 31, Domestic $ ( 198 ) $ ( 287 ) $ ( 412 ) Noncontrolling interest and redeemable noncontrolling interest ( 87 ) Foreign 1,211 ( 465 ) ( 506 ) Income (loss) before income taxes $ 1,154 $ ( 665 ) $ ( 1,005 )"
      ],
      "table_38": [
        "Year Ended December 31, Current: Federal $ — $ — $ ( 1 ) State Foreign Total current Deferred: Federal — ( 4 ) — State — — — Foreign Total deferred Total provision for income taxes $ $ $"
      ],
      "table_39": [
        "December 31, December 31, Deferred tax assets: Net operating loss carry-forwards $ 2,172 $ 1,846 Research and development credits Other tax credits Deferred revenue Inventory and warranty reserves Stock-based compensation Operating lease right-of-use liabilities Deferred GILTI tax assets — Accruals and others Total deferred tax assets 4,948 3,410 Valuation allowance ( 2,930 ) ( 1,956 ) Deferred tax assets, net of valuation allowance 2,018 1,454 Deferred tax liabilities: Depreciation and amortization ( 1,488 ) ( 1,185 ) Investment in certain financing funds ( 198 ) ( 17 ) Operating lease right-of-use assets ( 305 ) ( 263 ) Deferred revenue ( 50 ) — Other ( 61 ) ( 24 ) Total deferred tax liabilities ( 2,102 ) ( 1,489 ) Deferred tax liabilities, net of valuation allowance and deferred tax assets $ ( 84 ) $ ( 35 )"
      ],
      "table_40": [
        "Year Ended December 31, Tax at statutory federal rate $ $ ( 139 ) $ ( 211 ) State tax, net of federal benefit Nondeductible executive compensations Other nondeductible expenses Excess tax benefits related to stock based compensation ( 666 ) ( 7 ) ( 44 ) Foreign income rate differential U.S. tax credits ( 181 ) ( 107 ) ( 80 ) Noncontrolling interests and redeemable noncontrolling interests adjustment ( 29 ) GILTI inclusion — — Convertible debt — ( 4 ) — Unrecognized tax benefits Change in valuation allowance Provision for income taxes $ $ $"
      ],
      "table_41": [
        "December 31, 2017 $ Decreases in balances related to prior year tax positions ( 6 ) Increases in balances related to current year tax positions December 31, 2018 Decreases in balances related to prior year tax positions ( 39 ) Increases in balances related to current year tax positions December 31, 2019 Increases in balances related to prior year tax positions Increases in balances related to current year tax positions December 31, 2020 $"
      ],
      "table_42": [
        "December 31, December 31, Assets Current assets Cash and cash equivalents $ $ Accounts receivable, net Prepaid expenses and other current assets Total current assets Operating lease vehicles, net — 1,183 Solar energy systems, net 4,749 5,030 Other non-current assets Total assets $ 5,151 $ 6,602 Liabilities Current liabilities Accrued liabilities and other $ $ Deferred revenue Customer deposits Current portion of debt and finance leases Total current liabilities Deferred revenue, net of current portion Debt and finance leases, net of current portion 1,346 1,516 Other long-term liabilities Total liabilities $ 2,418 $ 2,577"
      ],
      "table_43": [
        "Year Ended December 31, Automotive segment Revenues $ 29,542 $ 23,047 $ 19,906 Gross profit $ 6,612 $ 3,879 $ 3,852 Energy generation and storage segment Revenues $ 1,994 $ 1,531 $ 1,555 Gross profit $ $ $"
      ],
      "table_44": [
        "Year Ended December 31, United States $ 15,207 $ 12,653 $ 14,872 China 6,662 2,979 1,757 Other 9,667 8,946 4,832 Total $ 31,536 $ 24,578 $ 21,461"
      ],
      "table_45": [
        "Three Months Ended March 31 June 30 September 30 December 31 Total revenues $ 5,985 $ 6,036 $ 8,771 $ 10,744 Gross profit $ 1,234 $ 1,267 $ 2,063 $ 2,066 Net income attributable to common stockholders $ $ $ $ Net income per share of common stock attributable to common stockholders, basic (1) $ 0.02 $ 0.11 $ 0.32 $ 0.28 Net income per share of common stock attributable to common stockholders, diluted (1) $ 0.02 $ 0.10 $ 0.27 $ 0.24 Total revenues $ 4,541 $ 6,350 $ 6,303 $ 7,384 Gross profit $ $ $ 1,191 $ 1,391 Net (loss) income attributable to common stockholders $ ( 702 ) $ ( 408 ) $ $ Net (loss) income per share of common stock attributable to common stockholders, basic (1) $ ( 0.82 ) $ ( 0.46 ) $ 0.16 $ 0.12 Net (loss) income per share of common stock attributable to common stockholders, diluted (1) $ ( 0.82 ) $ ( 0.46 ) $ 0.16 $ 0.11"
      ]
    },
    "table_count": 45,
    "word_count": 4492,
    "character_count": 25347,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "8",
      "original_length": 289631,
      "original_word_count": 42916,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/1318605/000156459021004599/tsla-10k_20201231.htm",
      "filing_date": "2021-02-08T07:27:23-05:00"
    }
  },
  "9A": {
    "section_name": "Controls and Procedures",
    "tables": {
      "table_1": [
        "year ended December 31, 2020, which has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting."
      ],
      "table_2": [
        "December 31, 2020, our disclosure controls and procedures were designed at a reasonable assurance level and were effective to provide reasonable assurance that the information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and our Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosures."
      ],
      "table_3": [
        "assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements."
      ],
      "table_4": [
        "December 31, 2020, as stated in their report which is included herein."
      ],
      "table_5": [
        "December 31, 2020, which has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting."
      ],
      "table_6": [
        "financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that (1) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements."
      ]
    },
    "table_count": 6,
    "word_count": 329,
    "character_count": 2321,
    "has_financial_data": true,
    "original_metadata": {
      "section_code": "9A",
      "original_length": 4420,
      "original_word_count": 623,
      "filing_url": "https://www.sec.gov/Archives/edgar/data/1318605/000156459021004599/tsla-10k_20201231.htm",
      "filing_date": "2021-02-08T07:27:23-05:00"
    }
  }
}