{
  "company_name": "AMC Entertainment Holdings Inc.",
  "statement_type": "income_statement",
  "currency_unit": "billions",
  "years": [
    "2024",
    "2019",
    "2018",
    "2017"
  ],
  "confidence": 0.6,
  "line_items": [
    {
      "name": "i) deferred rent, landlord allowances, unfavorable lease balances, and theatre closure liabilities previously recorded in other long-term liabilities; (ii) current portions of theatre closure liabilities previously recorded in accrued expenses and other liabilities; (iii) favorable lease balances previously recorded in intangible assets; and, (iv) prepaid rents recorded in other current assets within the consolidated balance sheets as an offset or addition to the opening lease ROU asset balances, as required by ASC",
      "values": [
        842.0,
        0.0,
        0.0,
        0.0
      ],
      "years": [
        "2024",
        "2019",
        "2018",
        "2017"
      ],
      "category": "Cost",
      "confidence": 0.4,
      "parent_item": "See Notes to Consolidated Financial Statements ​ ​ AMC ENTERTAINMENT HOLDINGS, INC. ​ NOTES TO CONSOLIDATED FINANCIAL STATEMENTS ​ Years Ended December 31, 2019, 2018, 2017 ​ NOTE 1—THE COMPANY AND SIGNIFICANT ACCOUNTING POLICIES ​ AMC Entertainment Holdings, Inc. (“Holdings”), through its direct and indirect subsidiaries, including American Multi-Cinema, Inc. and its subsidiaries, (collectively with Holdings, unless the context otherwise requires, the “Company” or “AMC”), is principally involved in the theatrical exhibition business and owns, operates or has interests in theatres located in the United States and Europe. Holdings is an indirect subsidiary of Dalian Wanda Group Co., Ltd. (“Wanda”), a Chinese private conglomerate. As of December 31, 2019, Wanda owned approximately 49.85 % of Holdings’ outstanding common stock and 74.89 % of the combined voting power of Holdings’ outstanding common stock and has the power to control Holdings’ affairs and policies, including with respect to the election of directors (and, through the election of directors, the appointment of management), entering into mergers, sales of substantially all of the Company’s assets and other extraordinary transactions. Use of Estimates. The preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. Principles of Consolidation. The consolidated financial statements include the accounts of Holdings and all subsidiaries, as discussed above. All significant intercompany balances and transactions have been eliminated in consolidation. There are no noncontrolling interests in the Company’s consolidated subsidiaries; consequently, all of its stockholders’ equity, net earnings (loss) and comprehensive income (loss) for the periods presented are attributable to controlling interests. The Company manages its business under two reportable segments for its theatrical exhibition operations, U.S. Theatres and International Theatres. Revenues. The Company recognizes revenue, net of sales tax, when it satisfies a performance obligation by transferring control over a product or service to a customer. Admissions and food and beverage revenues are recognized at a point in time when a film is exhibited to a customer and when a customer takes possession of food and beverage offerings. The Company defers 100 % of the revenue associated with the sales of gift cards and exchange tickets until such time as the items are redeemed or estimated income from non-redemption is recorded. The Company recognizes income from non-redeemed or partially redeemed gift cards in proportion to the pattern of rights exercised by the customer (“proportional method”) where it applies an estimated non-redemption rate for its gift card sales channels, which range from 12 % to 18 % of the current month sales of gift cards, and the Company recognizes in other theatre revenues the total amount of expected income for non-redemption for that current month’s sales as income over the next 24 months in proportion to the pattern of actual redemptions. The Company has determined its non-redeemed rates and redemption patterns using data accumulated over ten years. Prior to January 1, 2018, income for non-redeemed exchange tickets were recognized 18 months after purchase when the redemption of these items was determined to be remote. At January 1, 2018, the Company changed its method for recognizing income from non-redeemed exchange tickets to the proportional method, where it applies a non-redemption rate of 10 % to the current month sales, and the Company recognizes the total amount of income for that current month’s sales as income over the next 24 months in proportion to the pattern of actual redemptions. Management believes the 24-month estimate is supported by its continued development of redemption history and that it is reflective of management’s current best estimate. The adoption of the proportional method of recognizing income from non-redeemed exchange tickets did not have a material impact on the Company’s consolidated financial statements. Prior to January 1, 2018, the Company recorded online ticket fee revenues net of third-party commission or service fees. In accordance with ASC 606 guidance, the Company believes that it is a principal (as opposed to agent) in the arrangement with third-party internet ticketing companies in regard to the sale of online tickets because the Company controls the online tickets before they are transferred to the customer. Upon adoption of ASC 606 on January 1, 2018, the Company recognizes ticket fee revenues based on a gross transaction price. The online ticket fee revenues and the third-party commission or service fees are recorded in the line items other theatre revenues and operating expense, respectively, in the consolidated statements of operations. These changes did not have any impact on net income or cash flows from operations. Film Exhibition Costs. Film exhibition costs are accrued based on the applicable box office receipts and estimates of the final settlement to the film licensors. Film exhibition costs include certain advertising costs. As of December 31, 2019 and December 31, 2018, the Company recorded film payables of $166.5 million and $168.6 million, respectively, which are included in accounts payable in the accompanying consolidated balance sheets. Food and Beverage Costs. The Company records rebate payments from vendors as a reduction of food and beverage costs when earned. Exhibitor Services Agreement. The Company recognizes advertising revenues, which are included in other theatre revenues in the consolidated statements of operations, when it satisfies a performance obligation by transferring a promised good or service to the customers. The advertising contracts with customers generally consist of a series of distinct periods of service, satisfied over time, to provide rights to advertising services. The Company’s Exhibitor Services Agreement (“ESA”) with NCM includes a significant financing component due to the significant length of time between receiving the non-cash consideration and fulfilling the performance obligation. The Company receives the non-cash consideration in the form of common membership units from NCM, in exchange for rights to exclusive access to the Company’s theatre screens and attendees through February 2037. Upon adoption of ASC 606, Revenue from Contracts with Customers (“ASC 606”) on January 1, 2018, the Company’s advertising revenues have significantly increased with a similar offsetting increase in non-cash interest expense, which is recorded to non-cash NCM exhibitor service agreement in the consolidated statements of operations. Upon adoption of ASC 606 and pursuant to the calculation requirements for the time value of money, the amortization method reflects the front-end loading of the significant financing component where more interest expense is recognized earlier during the term of the agreement than the back-end recognition of the deferred revenue amortization where more revenue is recognized later in the term of the agreement. See Note 6 — Investments for further information regarding the common unit adjustment and the fair value measurement of the non-cash consideration. The interest expense was calculated using discount rates that ranged from 6.5 % to 8.5 %, which are the rates at which the Company believes it could borrow in separate financing transactions. The Company recognized a cumulative effect transition adjustment of initially applying ASC 606 by increasing accumulated deficit on January 1, 2018 by approximately $52.9 million, including income tax effect of $0 , as a result of this change. These changes did not have any impact on the Company’s cash flows from operations. Customer Engagement Programs. AMC Stubs ® is a customer loyalty program for the U.S. market which allows members to earn rewards, receive discounts and participate in exclusive members-only offerings and services. It features both a traditional paid tier called AMC Stubs Premiere TM , with a $15.00 annual membership fee, and a non-paid tier called AMC Stubs ® Insider TM . Both programs reward loyal guests for their patronage of AMC Theatres. Rewards earned are redeemable on future purchases at AMC locations. Once an AMC Stubs Premiere TM or AMC Stubs Insider TM member accumulates 5,000 points they will earn a $5.00 virtual reward. The portion of the admissions and food and beverage revenues attributed to the rewards is deferred as a reduction of admissions and food and beverage revenues and is allocated between admissions and food and beverage revenues based on expected member redemptions. Upon redemption, deferred rewards are recognized as revenues along with associated cost of goods. Converted rewards not redeemed within nine months are forfeited and recognized as admissions or food and beverage revenues. Prior to January 1, 2018, rewards for expired memberships were forfeited based upon specified periods of inactivity of the membership and recognized as admissions or food and beverage revenues. As of January 1, 2018, the Company changed its method for recognizing forfeited rewards from the remote method to the proportional method, where the Company estimates point breakage in assigning value to the points at the time of sale based on historical trends. The program’s annual membership fee is allocated to the material rights for discounted or free products and services and is initially deferred, net of estimated refunds, and recognized as the rights are redeemed based on estimated utilization, over the one-year membership period in admissions, food and beverage, and other revenues. A portion of the revenues related to a material right are deferred as a virtual rewards performance obligation using the relative standalone selling price method and are recognized as the rights are redeemed or expire. On June 20, 2018, the Company announced the launch of AMC Stubs ® A-List, a new tier of the AMC Stubs ® loyalty program. This program offers guests a unique subscription pricing structure for admission to movies at AMC up to three times per week including multiple movies per day and repeat visits to already seen movies for the monthly price of between $19.95 and $23.95 depending upon geographic market. Revenue is recognized ratably over the enrollment period. Advertising Costs. The Company expenses advertising costs as incurred and does not have any direct-response advertising recorded as assets. Advertising costs were $42.6 million, $45.4 million, and $39.9 million for the years ended December 31, 2019, December 31, 2018, and December 31, 2017, respectively, and are recorded in operating expense in the accompanying consolidated statements of operations. Cash and Equivalents. All highly liquid debt instruments and investments purchased with an original maturity of three months or less are classified as cash equivalents. Derivative Asset and Liability. The Company remeasures the derivative asset related to its contingent call option to acquire shares of its Class B common stock at no additional cost and the derivative liability related to the conversion feature in its Senior Unsecured Convertible Notes due 2024 at fair value each reporting period with changes in fair value recorded in the consolidated statement of operations. The Company has obtained independent third-party valuation studies to assist in determining fair value. The Company’s valuation studies use a Monte Carlo simulation approach and are based on significant inputs not observable in the market and thus represent level 3 measurements within the fair value measurement hierarchy. The Company’s common stock price at the end of each reporting period as well as the remaining amount of time until expiration for the contingent call option and conversion feature are key inputs for the estimation of fair value that are expected to change each reporting period. The Company recorded other expense (income) related to its derivative asset fair value of $17.7 million and $(45.0) million during the years ended December 31, 2019 and December 31, 2018, respectively, and other expense (income) related to its derivative liability fair value of $(23.5) million and $(66.4) million during the years ended December 31, 2019 and December 31, 2018, respectively. See Note 8 — Corporate Borrowings and Finance Lease Obligations, Note 9 — Stockholders’ Equity and Note 12 — Fair Value Measurements for further discussions. Intangible Assets. Intangible assets were recorded at fair value for intangible assets resulting from the acquisition of Holdings by Wanda on August 30, 2012 and other theatre acquisitions. Intangible assets are comprised of amounts assigned to theatre leases acquired under favorable terms, management contracts, a contract with an equity method investee, and a non-compete agreement, each of which are being amortized on a straight-line basis over the estimated remaining useful lives of the assets. Favorable leases that were previously classified as intangible assets were reclassified as an addition to the opening right-of-use (“ROU”) asset balances, as a result of adopting ASC 842, Leases, (“ASC 842”) on January 1, 2019. Trademark and trade names are considered either definite or indefinite-lived intangible assets. Indefinite-lived intangible assets are not amortized but rather evaluated for impairment annually. The Company first assesses the qualitative factors to determine whether the existence of events and circumstances indicate that it is more likely than not the fair value of an indefinite-lived intangible asset is less than its carrying amount as a basis for determining whether it is necessary to perform the quantitative impairment test. As a result, there were no intangible asset impairment charges incurred during the years ended December 31, 2019, December 31, 2018, and December 31, 2017. Investments. The Company accounts for its investments in non-consolidated entities using either the cost or equity methods of accounting as appropriate, and has recorded the investments within other long-term assets in its consolidated balance sheets. Equity earnings and losses are recorded when the Company’s ownership interest provides the Company with significant influence. The Company follows the guidance in ASC 323-30-35-3, investment in a limited liability company, which prescribes the use of the equity method for investments where the Company has significant influence. The Company classifies gains and losses on sales of investments or impairments accounted for using the cost method in investment income. Gains and losses on cash sales are recorded using the weighted average cost of all interests in the investments. Gains and losses related to non-cash negative common unit adjustments are recorded using the weighted average cost of those units in NCM. See Note 6 — Investments for further discussion of the Company’s investments in NCM. As of December 31, 2019, the Company holds equity method investments comprised of a 18.2 % interest in SV Holdco LLC (“SV Holdco”), a joint venture that markets and sells cinema advertising and promotions through Screenvision; a 50.0 % interest in Digital CineMedia Ltd. (“DCM”), a joint venture that provides advertising services in International markets; a 32.0 % interest in AC JV, LLC (“AC JV”), a joint venture that owns Fathom Events offering alternative content for motion picture screens; a 29.0 % interest in Digital Cinema Implementation Partners, LLC (“DCIP”), a joint venture charged with implementing digital cinema in the Company’s theatres; a 14.6 % interest in Digital Cinema Distribution Coalition, LLC (“DCDC”), a satellite distribution network for feature films and other digital cinema content; a 10.0 % interest in Saudi Cinema Company LLC (“SCC”); a 50 % ownership interest in four U.S. motion picture theatres and approximately 50 % ownership interest in 55 theatres in Europe. Indebtedness held by equity method investees is non-recourse to the Company. Goodwill. Goodwill represents the excess of purchase price over fair value of net tangible and identifiable intangible assets related to the acquisition of Holdings by Wanda on August 30, 2012 and subsequent theatre business acquisitions. Prior to January 1, 2019, the Company had three reporting units, Domestic Theatres, Odeon Theatres and Nordic Theatres. Effective January 1, 2019, the Company combined the Odeon Theatres and Nordic Theatres into a single reporting unit, International Theatres, to reflect how the international business is now managed. The Company tested goodwill for impairment both prior to and subsequent to the combining of these reporting units into the single reporting unit. The Company’s recorded goodwill was $4,789.1 million and $4,788.7 million as of December 31, 2019 and December 31, 2018, respectively. The Company evaluates goodwill and its indefinite-lived trademark and trade names for impairment annually as of the beginning of the fourth quarter and any time an event occurs or circumstances change that would more likely than not reduce the fair value for a reporting unit below its carrying amount. A decline in the common stock price and the resulting impact on market capitalization is one of several factors considered when making this evaluation. Based on recent sustained declines in the trading price of the Company’s Class A common stock, the Company performed a quantitative goodwill impairment test of the Domestic and International reporting units as of September 30, 2019. In performing the annual impairment test, the Company has an option to first assess the qualitative factors to determine whether it is more likely than not that the fair value of its reporting units are less than the carrying values. Otherwise, the Company must perform a quantitative impairment test. The impairment test for goodwill involves estimating the fair value of the reporting unit and comparing that value to its carrying value. If the estimated fair value of the reporting unit is less than its carrying value, the difference is recorded as goodwill impairment charge, not to exceed the total amount of goodwill allocated to that reporting unit. In performing the quantitative goodwill impairment test as of September 30, 2019, the Company used an enterprise value approach to measure fair value of the reporting units, as compared to an equity value approach used previously. This change in estimate is preferable due to the impact of the change in the capital structure of the Domestic Theatres reporting unit late in the third quarter of 2018 as a result of the issuance of $600 million of the Company’s Senior Unsecured Notes due 2024, the negative equity value carrying amount for the Domestic Theatres reporting unit, and the decline in the market capitalization since May 2019, which has increased the Company’s leverage ratio. See additional discussion in Note 6 — Corporate Borrowings. The enterprise fair values of the Domestic Theatres and International Theatres reporting units exceeded their carrying values by approximately 9.9 % and 11.8 %, respectively. Accordingly, there was no goodwill impairment recorded as of September 30, 2019. In accordance with ASC 350-20-35-30, goodwill of a reporting unit shall be tested for impairment between annual tests if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying amount. The Company performed an assessment to determine whether there were any events or changes in circumstances that would warrant an interim ASC 350 impairment analysis as of December 31, 2019. Given the further decline in the Company’s stock price during the fourth quarter of 2019, the Company performed a qualitative impairment test to evaluate whether it is more likely than not that the fair value of its two reporting units are less than their respective carrying amounts as of December 31, 2019. The Company compared its projected financial information and assumptions utilized in the quantitative analysis as of September 30, 2019 to the fourth quarter results noting operating performance is consistent with the projections and there have been no other changes which would impact management’s conclusion that the fair values of its reporting units exceed their carrying values. The Company also observed that its estimated fair value of its corporate borrowings and finance lease obligations remained relatively consistent from September 30, 2019 to December 31, 2019, which represents approximately 80 % of the Company’s market enterprise value. The Company observed higher enterprise value control premiums for a recent acquisition agreement in its industry than those utilized for the market approach. In considering the totality of the aforementioned factors together with the excess of fair value over carrying value calculated in both its reporting units in the previous impairment test, the Company has concluded that it is not more likely than not that the fair values of its two reporting units have been reduced below their respective carrying amounts. As a result, the Company concluded that an interim quantitative impairment test as of December 31, 2019 was not required. The Domestic Theatres reporting unit to which $3.1 billion of goodwill is allocated had a negative equity value carrying amount as of December 31, 2019. As of December 31, 2018, the Company assessed qualitative factors for both of its reporting units and reached a determination that it is not more likely than not that the fair value of the Company’s reporting units are less than their carrying values, and therefore no impairment charge was incurred. In addition, the Company performed its annual impairment analysis during the fourth quarter of calendar 2018 and the third quarter and fourth quarter of calendar 2017. In all of these impairment tests, the Company reached a determination that there was no goodwill impairment. Other Long-term Assets. Other long-term assets are comprised principally of investments in partnerships and joint ventures, costs incurred in connection with the Company’s line-of-credit revolving credit arrangement, which is being amortized to interest expense using the effective interest rate method over the respective life of the issuance, and capitalized computer software, which is amortized over the estimated useful life of the software. See Note 7 — Supplemental Balance Sheet Information. Accounts Payable. Under the Company’s cash management system, checks issued but not presented to banks frequently result in book overdraft balances for accounting purposes and are classified within accounts payable in the balance sheet. The change in book overdrafts are reported as a component of operating cash flows for accounts payable as they do not represent bank overdrafts. The amount of these checks included in accounts payable as of December 31, 2019 and December 31, 2018 was $40.9 million and $42.6 million, respectively. Leases. The Company adopted ASC 842 on January 1, 2019 using the modified retrospective transition method; and therefore, the comparative information has not been adjusted for the years ended December 31, 2018 and December 31, 2017 or as of December 31, 2018. Upon transition to the new standard, the Company elected the package of practical expedients, which permitted the Company not to reassess under the new standard its prior conclusions about lease identification, lease classification and initial direct costs. The Company leases theatres and equipment under operating and finance leases. The majority of the Company’s operations are conducted in premises occupied under lease agreements with initial base terms ranging generally from 12 to 15 years , with certain leases containing options to extend the leases for up to an additional 20 years . The Company typically does not believe that exercise of the renewal options is reasonably assured at the inception of the lease agreements and, therefore, considers the initial base term as the lease term. Lease terms vary but generally the leases provide for fixed and escalating rentals, contingent escalating rentals based on the Consumer Price Index and other indexes not to exceed certain specified amounts and variable rentals based on a percentage of revenues. The Company often receives contributions from landlords for renovations at existing locations. The Company records the amounts received from landlords as an adjustment to the right-of-use asset and amortizes the balance as a reduction to rent expense over the base term of the lease agreement. Operating lease right-of-use assets and lease liabilities were recognized at commencement date based on the present value of minimum lease payments over the remaining lease term. The minimum lease payments include base rent and other fixed payments, including fixed maintenance costs. The Company’s leases have remaining lease terms of approximately 1 year to 25 years , which may include the option to extend the lease when it is reasonably certain the Company will exercise that option. The present value of the lease payments is calculated using the incremental borrowing rate for operating leases, which was determined using a portfolio approach based on the rate of interest that the Company would have to pay to borrow an amount equal to the lease payments on a collateralized basis over a similar term. Operating lease expense is recognized on a straight-line basis over the lease term. The Company elected the practical expedient to not separate lease and non-lease components and also elected the short-term practical expedient for all leases that qualify. As a result, the Company will not recognize right-of-use assets or liabilities for short-term leases that qualify for the short-term practical expedient, but instead will recognize the lease payments as lease cost on a straight-line basis over the lease term. The Company’s lease agreements do not contain residual value guarantees. Short-term leases and sublease arrangements are immaterial. Equipment leases primarily consist of digital projectors and food and beverage equipment. As a result of adopting ASC 842, the Company’s consolidated balance sheet includes additional operating lease ROU assets and total operating lease liabilities of $4,796.0 million and $5,499.6 million, respectively, at December 31, 2019. The difference between the lease ROU assets and total lease liabilities upon initial measurement at January 1, 2019 was primarily due to the reclassification of",
      "is_total": false
    },
    {
      "name": "i) deferred rent, landlord allowances, unfavorable lease balances, and theatre closure liabilities previously recorded in other long-term liabilities; (ii) current portions of theatre closure liabilities previously recorded in accrued expenses and other liabilities; (iii) favorable lease balances previously recorded in intangible assets; and, (iv) prepaid rents recorded in other current assets within the consolidated balance sheets as an offset or addition to the opening lease ROU asset balances, as required by ASC",
      "values": [
        842.0,
        0.0,
        0.0,
        0.0
      ],
      "years": [
        "2024",
        "2019",
        "2018",
        "2017"
      ],
      "category": "Cost",
      "confidence": 0.4,
      "parent_item": "See Notes to Consolidated Financial Statements ​ ​ AMC ENTERTAINMENT HOLDINGS, INC. ​ NOTES TO CONSOLIDATED FINANCIAL STATEMENTS ​ Years Ended December 31, 2019, 2018, 2017 ​ NOTE 1—THE COMPANY AND SIGNIFICANT ACCOUNTING POLICIES ​ AMC Entertainment Holdings, Inc. (“Holdings”), through its direct and indirect subsidiaries, including American Multi-Cinema, Inc. and its subsidiaries, (collectively with Holdings, unless the context otherwise requires, the “Company” or “AMC”), is principally involved in the theatrical exhibition business and owns, operates or has interests in theatres located in the United States and Europe. Holdings is an indirect subsidiary of Dalian Wanda Group Co., Ltd. (“Wanda”), a Chinese private conglomerate. As of December 31, 2019, Wanda owned approximately 49.85 % of Holdings’ outstanding common stock and 74.89 % of the combined voting power of Holdings’ outstanding common stock and has the power to control Holdings’ affairs and policies, including with respect to the election of directors (and, through the election of directors, the appointment of management), entering into mergers, sales of substantially all of the Company’s assets and other extraordinary transactions. Use of Estimates. The preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. Principles of Consolidation. The consolidated financial statements include the accounts of Holdings and all subsidiaries, as discussed above. All significant intercompany balances and transactions have been eliminated in consolidation. There are no noncontrolling interests in the Company’s consolidated subsidiaries; consequently, all of its stockholders’ equity, net earnings (loss) and comprehensive income (loss) for the periods presented are attributable to controlling interests. The Company manages its business under two reportable segments for its theatrical exhibition operations, U.S. Theatres and International Theatres. Revenues. The Company recognizes revenue, net of sales tax, when it satisfies a performance obligation by transferring control over a product or service to a customer. Admissions and food and beverage revenues are recognized at a point in time when a film is exhibited to a customer and when a customer takes possession of food and beverage offerings. The Company defers 100 % of the revenue associated with the sales of gift cards and exchange tickets until such time as the items are redeemed or estimated income from non-redemption is recorded. The Company recognizes income from non-redeemed or partially redeemed gift cards in proportion to the pattern of rights exercised by the customer (“proportional method”) where it applies an estimated non-redemption rate for its gift card sales channels, which range from 12 % to 18 % of the current month sales of gift cards, and the Company recognizes in other theatre revenues the total amount of expected income for non-redemption for that current month’s sales as income over the next 24 months in proportion to the pattern of actual redemptions. The Company has determined its non-redeemed rates and redemption patterns using data accumulated over ten years. Prior to January 1, 2018, income for non-redeemed exchange tickets were recognized 18 months after purchase when the redemption of these items was determined to be remote. At January 1, 2018, the Company changed its method for recognizing income from non-redeemed exchange tickets to the proportional method, where it applies a non-redemption rate of 10 % to the current month sales, and the Company recognizes the total amount of income for that current month’s sales as income over the next 24 months in proportion to the pattern of actual redemptions. Management believes the 24-month estimate is supported by its continued development of redemption history and that it is reflective of management’s current best estimate. The adoption of the proportional method of recognizing income from non-redeemed exchange tickets did not have a material impact on the Company’s consolidated financial statements. Prior to January 1, 2018, the Company recorded online ticket fee revenues net of third-party commission or service fees. In accordance with ASC 606 guidance, the Company believes that it is a principal (as opposed to agent) in the arrangement with third-party internet ticketing companies in regard to the sale of online tickets because the Company controls the online tickets before they are transferred to the customer. Upon adoption of ASC 606 on January 1, 2018, the Company recognizes ticket fee revenues based on a gross transaction price. The online ticket fee revenues and the third-party commission or service fees are recorded in the line items other theatre revenues and operating expense, respectively, in the consolidated statements of operations. These changes did not have any impact on net income or cash flows from operations. Film Exhibition Costs. Film exhibition costs are accrued based on the applicable box office receipts and estimates of the final settlement to the film licensors. Film exhibition costs include certain advertising costs. As of December 31, 2019 and December 31, 2018, the Company recorded film payables of $166.5 million and $168.6 million, respectively, which are included in accounts payable in the accompanying consolidated balance sheets. Food and Beverage Costs. The Company records rebate payments from vendors as a reduction of food and beverage costs when earned. Exhibitor Services Agreement. The Company recognizes advertising revenues, which are included in other theatre revenues in the consolidated statements of operations, when it satisfies a performance obligation by transferring a promised good or service to the customers. The advertising contracts with customers generally consist of a series of distinct periods of service, satisfied over time, to provide rights to advertising services. The Company’s Exhibitor Services Agreement (“ESA”) with NCM includes a significant financing component due to the significant length of time between receiving the non-cash consideration and fulfilling the performance obligation. The Company receives the non-cash consideration in the form of common membership units from NCM, in exchange for rights to exclusive access to the Company’s theatre screens and attendees through February 2037. Upon adoption of ASC 606, Revenue from Contracts with Customers (“ASC 606”) on January 1, 2018, the Company’s advertising revenues have significantly increased with a similar offsetting increase in non-cash interest expense, which is recorded to non-cash NCM exhibitor service agreement in the consolidated statements of operations. Upon adoption of ASC 606 and pursuant to the calculation requirements for the time value of money, the amortization method reflects the front-end loading of the significant financing component where more interest expense is recognized earlier during the term of the agreement than the back-end recognition of the deferred revenue amortization where more revenue is recognized later in the term of the agreement. See Note 6 — Investments for further information regarding the common unit adjustment and the fair value measurement of the non-cash consideration. The interest expense was calculated using discount rates that ranged from 6.5 % to 8.5 %, which are the rates at which the Company believes it could borrow in separate financing transactions. The Company recognized a cumulative effect transition adjustment of initially applying ASC 606 by increasing accumulated deficit on January 1, 2018 by approximately $52.9 million, including income tax effect of $0 , as a result of this change. These changes did not have any impact on the Company’s cash flows from operations. Customer Engagement Programs. AMC Stubs ® is a customer loyalty program for the U.S. market which allows members to earn rewards, receive discounts and participate in exclusive members-only offerings and services. It features both a traditional paid tier called AMC Stubs Premiere TM , with a $15.00 annual membership fee, and a non-paid tier called AMC Stubs ® Insider TM . Both programs reward loyal guests for their patronage of AMC Theatres. Rewards earned are redeemable on future purchases at AMC locations. Once an AMC Stubs Premiere TM or AMC Stubs Insider TM member accumulates 5,000 points they will earn a $5.00 virtual reward. The portion of the admissions and food and beverage revenues attributed to the rewards is deferred as a reduction of admissions and food and beverage revenues and is allocated between admissions and food and beverage revenues based on expected member redemptions. Upon redemption, deferred rewards are recognized as revenues along with associated cost of goods. Converted rewards not redeemed within nine months are forfeited and recognized as admissions or food and beverage revenues. Prior to January 1, 2018, rewards for expired memberships were forfeited based upon specified periods of inactivity of the membership and recognized as admissions or food and beverage revenues. As of January 1, 2018, the Company changed its method for recognizing forfeited rewards from the remote method to the proportional method, where the Company estimates point breakage in assigning value to the points at the time of sale based on historical trends. The program’s annual membership fee is allocated to the material rights for discounted or free products and services and is initially deferred, net of estimated refunds, and recognized as the rights are redeemed based on estimated utilization, over the one-year membership period in admissions, food and beverage, and other revenues. A portion of the revenues related to a material right are deferred as a virtual rewards performance obligation using the relative standalone selling price method and are recognized as the rights are redeemed or expire. On June 20, 2018, the Company announced the launch of AMC Stubs ® A-List, a new tier of the AMC Stubs ® loyalty program. This program offers guests a unique subscription pricing structure for admission to movies at AMC up to three times per week including multiple movies per day and repeat visits to already seen movies for the monthly price of between $19.95 and $23.95 depending upon geographic market. Revenue is recognized ratably over the enrollment period. Advertising Costs. The Company expenses advertising costs as incurred and does not have any direct-response advertising recorded as assets. Advertising costs were $42.6 million, $45.4 million, and $39.9 million for the years ended December 31, 2019, December 31, 2018, and December 31, 2017, respectively, and are recorded in operating expense in the accompanying consolidated statements of operations. Cash and Equivalents. All highly liquid debt instruments and investments purchased with an original maturity of three months or less are classified as cash equivalents. Derivative Asset and Liability. The Company remeasures the derivative asset related to its contingent call option to acquire shares of its Class B common stock at no additional cost and the derivative liability related to the conversion feature in its Senior Unsecured Convertible Notes due 2024 at fair value each reporting period with changes in fair value recorded in the consolidated statement of operations. The Company has obtained independent third-party valuation studies to assist in determining fair value. The Company’s valuation studies use a Monte Carlo simulation approach and are based on significant inputs not observable in the market and thus represent level 3 measurements within the fair value measurement hierarchy. The Company’s common stock price at the end of each reporting period as well as the remaining amount of time until expiration for the contingent call option and conversion feature are key inputs for the estimation of fair value that are expected to change each reporting period. The Company recorded other expense (income) related to its derivative asset fair value of $17.7 million and $(45.0) million during the years ended December 31, 2019 and December 31, 2018, respectively, and other expense (income) related to its derivative liability fair value of $(23.5) million and $(66.4) million during the years ended December 31, 2019 and December 31, 2018, respectively. See Note 8 — Corporate Borrowings and Finance Lease Obligations, Note 9 — Stockholders’ Equity and Note 12 — Fair Value Measurements for further discussions. Intangible Assets. Intangible assets were recorded at fair value for intangible assets resulting from the acquisition of Holdings by Wanda on August 30, 2012 and other theatre acquisitions. Intangible assets are comprised of amounts assigned to theatre leases acquired under favorable terms, management contracts, a contract with an equity method investee, and a non-compete agreement, each of which are being amortized on a straight-line basis over the estimated remaining useful lives of the assets. Favorable leases that were previously classified as intangible assets were reclassified as an addition to the opening right-of-use (“ROU”) asset balances, as a result of adopting ASC 842, Leases, (“ASC 842”) on January 1, 2019. Trademark and trade names are considered either definite or indefinite-lived intangible assets. Indefinite-lived intangible assets are not amortized but rather evaluated for impairment annually. The Company first assesses the qualitative factors to determine whether the existence of events and circumstances indicate that it is more likely than not the fair value of an indefinite-lived intangible asset is less than its carrying amount as a basis for determining whether it is necessary to perform the quantitative impairment test. As a result, there were no intangible asset impairment charges incurred during the years ended December 31, 2019, December 31, 2018, and December 31, 2017. Investments. The Company accounts for its investments in non-consolidated entities using either the cost or equity methods of accounting as appropriate, and has recorded the investments within other long-term assets in its consolidated balance sheets. Equity earnings and losses are recorded when the Company’s ownership interest provides the Company with significant influence. The Company follows the guidance in ASC 323-30-35-3, investment in a limited liability company, which prescribes the use of the equity method for investments where the Company has significant influence. The Company classifies gains and losses on sales of investments or impairments accounted for using the cost method in investment income. Gains and losses on cash sales are recorded using the weighted average cost of all interests in the investments. Gains and losses related to non-cash negative common unit adjustments are recorded using the weighted average cost of those units in NCM. See Note 6 — Investments for further discussion of the Company’s investments in NCM. As of December 31, 2019, the Company holds equity method investments comprised of a 18.2 % interest in SV Holdco LLC (“SV Holdco”), a joint venture that markets and sells cinema advertising and promotions through Screenvision; a 50.0 % interest in Digital CineMedia Ltd. (“DCM”), a joint venture that provides advertising services in International markets; a 32.0 % interest in AC JV, LLC (“AC JV”), a joint venture that owns Fathom Events offering alternative content for motion picture screens; a 29.0 % interest in Digital Cinema Implementation Partners, LLC (“DCIP”), a joint venture charged with implementing digital cinema in the Company’s theatres; a 14.6 % interest in Digital Cinema Distribution Coalition, LLC (“DCDC”), a satellite distribution network for feature films and other digital cinema content; a 10.0 % interest in Saudi Cinema Company LLC (“SCC”); a 50 % ownership interest in four U.S. motion picture theatres and approximately 50 % ownership interest in 55 theatres in Europe. Indebtedness held by equity method investees is non-recourse to the Company. Goodwill. Goodwill represents the excess of purchase price over fair value of net tangible and identifiable intangible assets related to the acquisition of Holdings by Wanda on August 30, 2012 and subsequent theatre business acquisitions. Prior to January 1, 2019, the Company had three reporting units, Domestic Theatres, Odeon Theatres and Nordic Theatres. Effective January 1, 2019, the Company combined the Odeon Theatres and Nordic Theatres into a single reporting unit, International Theatres, to reflect how the international business is now managed. The Company tested goodwill for impairment both prior to and subsequent to the combining of these reporting units into the single reporting unit. The Company’s recorded goodwill was $4,789.1 million and $4,788.7 million as of December 31, 2019 and December 31, 2018, respectively. The Company evaluates goodwill and its indefinite-lived trademark and trade names for impairment annually as of the beginning of the fourth quarter and any time an event occurs or circumstances change that would more likely than not reduce the fair value for a reporting unit below its carrying amount. A decline in the common stock price and the resulting impact on market capitalization is one of several factors considered when making this evaluation. Based on recent sustained declines in the trading price of the Company’s Class A common stock, the Company performed a quantitative goodwill impairment test of the Domestic and International reporting units as of September 30, 2019. In performing the annual impairment test, the Company has an option to first assess the qualitative factors to determine whether it is more likely than not that the fair value of its reporting units are less than the carrying values. Otherwise, the Company must perform a quantitative impairment test. The impairment test for goodwill involves estimating the fair value of the reporting unit and comparing that value to its carrying value. If the estimated fair value of the reporting unit is less than its carrying value, the difference is recorded as goodwill impairment charge, not to exceed the total amount of goodwill allocated to that reporting unit. In performing the quantitative goodwill impairment test as of September 30, 2019, the Company used an enterprise value approach to measure fair value of the reporting units, as compared to an equity value approach used previously. This change in estimate is preferable due to the impact of the change in the capital structure of the Domestic Theatres reporting unit late in the third quarter of 2018 as a result of the issuance of $600 million of the Company’s Senior Unsecured Notes due 2024, the negative equity value carrying amount for the Domestic Theatres reporting unit, and the decline in the market capitalization since May 2019, which has increased the Company’s leverage ratio. See additional discussion in Note 6 — Corporate Borrowings. The enterprise fair values of the Domestic Theatres and International Theatres reporting units exceeded their carrying values by approximately 9.9 % and 11.8 %, respectively. Accordingly, there was no goodwill impairment recorded as of September 30, 2019. In accordance with ASC 350-20-35-30, goodwill of a reporting unit shall be tested for impairment between annual tests if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying amount. The Company performed an assessment to determine whether there were any events or changes in circumstances that would warrant an interim ASC 350 impairment analysis as of December 31, 2019. Given the further decline in the Company’s stock price during the fourth quarter of 2019, the Company performed a qualitative impairment test to evaluate whether it is more likely than not that the fair value of its two reporting units are less than their respective carrying amounts as of December 31, 2019. The Company compared its projected financial information and assumptions utilized in the quantitative analysis as of September 30, 2019 to the fourth quarter results noting operating performance is consistent with the projections and there have been no other changes which would impact management’s conclusion that the fair values of its reporting units exceed their carrying values. The Company also observed that its estimated fair value of its corporate borrowings and finance lease obligations remained relatively consistent from September 30, 2019 to December 31, 2019, which represents approximately 80 % of the Company’s market enterprise value. The Company observed higher enterprise value control premiums for a recent acquisition agreement in its industry than those utilized for the market approach. In considering the totality of the aforementioned factors together with the excess of fair value over carrying value calculated in both its reporting units in the previous impairment test, the Company has concluded that it is not more likely than not that the fair values of its two reporting units have been reduced below their respective carrying amounts. As a result, the Company concluded that an interim quantitative impairment test as of December 31, 2019 was not required. The Domestic Theatres reporting unit to which $3.1 billion of goodwill is allocated had a negative equity value carrying amount as of December 31, 2019. As of December 31, 2018, the Company assessed qualitative factors for both of its reporting units and reached a determination that it is not more likely than not that the fair value of the Company’s reporting units are less than their carrying values, and therefore no impairment charge was incurred. In addition, the Company performed its annual impairment analysis during the fourth quarter of calendar 2018 and the third quarter and fourth quarter of calendar 2017. In all of these impairment tests, the Company reached a determination that there was no goodwill impairment. Other Long-term Assets. Other long-term assets are comprised principally of investments in partnerships and joint ventures, costs incurred in connection with the Company’s line-of-credit revolving credit arrangement, which is being amortized to interest expense using the effective interest rate method over the respective life of the issuance, and capitalized computer software, which is amortized over the estimated useful life of the software. See Note 7 — Supplemental Balance Sheet Information. Accounts Payable. Under the Company’s cash management system, checks issued but not presented to banks frequently result in book overdraft balances for accounting purposes and are classified within accounts payable in the balance sheet. The change in book overdrafts are reported as a component of operating cash flows for accounts payable as they do not represent bank overdrafts. The amount of these checks included in accounts payable as of December 31, 2019 and December 31, 2018 was $40.9 million and $42.6 million, respectively. Leases. The Company adopted ASC 842 on January 1, 2019 using the modified retrospective transition method; and therefore, the comparative information has not been adjusted for the years ended December 31, 2018 and December 31, 2017 or as of December 31, 2018. Upon transition to the new standard, the Company elected the package of practical expedients, which permitted the Company not to reassess under the new standard its prior conclusions about lease identification, lease classification and initial direct costs. The Company leases theatres and equipment under operating and finance leases. The majority of the Company’s operations are conducted in premises occupied under lease agreements with initial base terms ranging generally from 12 to 15 years , with certain leases containing options to extend the leases for up to an additional 20 years . The Company typically does not believe that exercise of the renewal options is reasonably assured at the inception of the lease agreements and, therefore, considers the initial base term as the lease term. Lease terms vary but generally the leases provide for fixed and escalating rentals, contingent escalating rentals based on the Consumer Price Index and other indexes not to exceed certain specified amounts and variable rentals based on a percentage of revenues. The Company often receives contributions from landlords for renovations at existing locations. The Company records the amounts received from landlords as an adjustment to the right-of-use asset and amortizes the balance as a reduction to rent expense over the base term of the lease agreement. Operating lease right-of-use assets and lease liabilities were recognized at commencement date based on the present value of minimum lease payments over the remaining lease term. The minimum lease payments include base rent and other fixed payments, including fixed maintenance costs. The Company’s leases have remaining lease terms of approximately 1 year to 25 years , which may include the option to extend the lease when it is reasonably certain the Company will exercise that option. The present value of the lease payments is calculated using the incremental borrowing rate for operating leases, which was determined using a portfolio approach based on the rate of interest that the Company would have to pay to borrow an amount equal to the lease payments on a collateralized basis over a similar term. Operating lease expense is recognized on a straight-line basis over the lease term. The Company elected the practical expedient to not separate lease and non-lease components and also elected the short-term practical expedient for all leases that qualify. As a result, the Company will not recognize right-of-use assets or liabilities for short-term leases that qualify for the short-term practical expedient, but instead will recognize the lease payments as lease cost on a straight-line basis over the lease term. The Company’s lease agreements do not contain residual value guarantees. Short-term leases and sublease arrangements are immaterial. Equipment leases primarily consist of digital projectors and food and beverage equipment. As a result of adopting ASC 842, the Company’s consolidated balance sheet includes additional operating lease ROU assets and total operating lease liabilities of $4,796.0 million and $5,499.6 million, respectively, at December 31, 2019. The difference between the lease ROU assets and total lease liabilities upon initial measurement at January 1, 2019 was primarily due to the reclassification of",
      "is_total": false
    }
  ]
}